{
  "version": "1.0.0",
  "updated": "2026-02-26T02:10:14.753762",
  "total_skills": 256,
  "skills": [
    {
      "name": "agent-designer",
      "description": "No description available",
      "tags": [],
      "category": "AI-Agents",
      "keywords": [
        "agent",
        "available",
        "description",
        "designer"
      ]
    },
    {
      "name": "ai-multimodal",
      "description": "Process and generate multimedia content using Google Gemini API. Capabilities include analyze audio files (transcription with timestamps, summarization, speech understanding, music/sound analysis up to 9.5 hours), understand images (captioning, object detection, OCR, visual Q&A, segmentation), process videos (scene detection, Q&A, temporal analysis, YouTube URLs, up to 6 hours), extract from...",
      "tags": [],
      "category": "AI-Agents",
      "keywords": [
        "analysis",
        "analyze",
        "analyzing",
        "api",
        "audio",
        "capabilities",
        "captioning",
        "charts",
        "composition",
        "content"
      ]
    },
    {
      "name": "chrome-devtools",
      "description": "Browser automation, debugging, and performance analysis using Puppeteer CLI scripts. Use for automating browsers, taking screenshots, analyzing performance, monitoring network traffic, web scraping, form automation, and JavaScript debugging.",
      "tags": [],
      "category": "AI-Agents",
      "keywords": [
        "analysis",
        "analyzing",
        "automating",
        "automation",
        "browser",
        "browsers",
        "chrome",
        "cli",
        "debugging",
        "devtools"
      ]
    },
    {
      "name": "claude-capabilities",
      "description": "Current Claude AI and Claude Code capabilities, features, and limits. Consult before making claims about what Claude can or cannot do, what features exist, model availability, pricing, or environment differences. Use when answering \"can Claude do X?\", comparing Claude AI vs Code, checking current model specs, or advising on which...",
      "tags": [],
      "category": "AI-Agents",
      "keywords": [
        "about",
        "advising",
        "answering",
        "availability",
        "before",
        "cannot",
        "capabilities",
        "checking",
        "claims",
        "claude"
      ]
    },
    {
      "name": "claude-code",
      "description": "No description available",
      "tags": [],
      "category": "AI-Agents",
      "keywords": [
        "available",
        "claude",
        "code",
        "description"
      ]
    },
    {
      "name": "context-engineering",
      "description": "Master context engineering for AI agent systems. Use when designing agent architectures, debugging context failures, optimizing token usage, implementing memory systems, building multi-agent coordination, evaluating agent performance, or developing LLM-powered pipelines. Covers context fundamentals, degradation patterns, optimization techniques (compaction, masking, caching), compression strategies, memory architectures, multi-agent patterns, LLM-as-Judge evaluation, tool...",
      "tags": [],
      "category": "AI-Agents",
      "keywords": [
        "agent",
        "architectures",
        "building",
        "caching",
        "compaction",
        "compression",
        "context",
        "coordination",
        "covers",
        "debugging"
      ]
    },
    {
      "name": "elevenlabs-agents",
      "description": "Build conversational AI voice agents with ElevenLabs Platform. Workflow: configure agent, add tools and knowledge base, integrate SDK, test, deploy. Supports React, React Native, and Swift SDKs. Use when building voice agents, AI phone systems, or troubleshooting @11labs deprecated packages, webhook errors, CSP violations, localhost allowlist, or tool parsing errors.",
      "tags": [],
      "category": "AI-Agents",
      "keywords": [
        "add",
        "agent",
        "agents",
        "allowlist",
        "base",
        "build",
        "building",
        "configure",
        "conversational",
        "csp"
      ]
    },
    {
      "name": "fine-tuning-expert",
      "description": "Use when fine-tuning LLMs, training custom models, or optimizing model performance for specific tasks. Invoke for parameter-efficient methods, dataset preparation, or model adaptation.",
      "tags": [],
      "category": "AI-Agents",
      "keywords": [
        "adaptation",
        "custom",
        "dataset",
        "efficient",
        "expert",
        "fine",
        "invoke",
        "llms",
        "methods",
        "model"
      ]
    },
    {
      "name": "gemini-guide",
      "description": "Look up Gemini API documentation, SDK patterns, and current best practices when building with Google Gemini. Maps topics to local cached docs and live sources, provides correct @google/genai patterns, and highlights deprecated vs current API usage. Trigger with 'gemini docs', 'gemini guide', 'how to use gemini', 'gemini SDK', '@google/genai', or...",
      "tags": [],
      "category": "AI-Agents",
      "keywords": [
        "api",
        "best",
        "building",
        "cached",
        "code",
        "correct",
        "current",
        "deprecated",
        "docs",
        "documentation"
      ]
    },
    {
      "name": "gemini-peer-review",
      "description": "Get a second opinion from Gemini on code, architecture, debugging, or security. Uses gemini-coach CLI with AI-to-AI prompting for clear, actionable analysis. Trigger with 'ask gemini', 'gemini review', 'second opinion', 'peer review', or 'consult gemini'.",
      "tags": [],
      "category": "AI-Agents",
      "keywords": [
        "actionable",
        "analysis",
        "architecture",
        "ask",
        "clear",
        "cli",
        "coach",
        "code",
        "consult",
        "debugging"
      ]
    },
    {
      "name": "google-adk-python",
      "description": "No description available",
      "tags": [],
      "category": "AI-Agents",
      "keywords": [
        "adk",
        "available",
        "description",
        "google",
        "python"
      ]
    },
    {
      "name": "google-chat-messages",
      "description": "Send Google Chat messages via webhook — text, rich cards (cardsV2), threaded replies. Includes TypeScript types, card builder utility, and widget reference.",
      "tags": [],
      "category": "AI-Agents",
      "keywords": [
        "builder",
        "card",
        "cards",
        "chat",
        "google",
        "includes",
        "messages",
        "reference",
        "replies",
        "rich"
      ]
    },
    {
      "name": "loki-mode",
      "description": "Multi-agent autonomous startup system - orchestrates 37 AI agents across 6 swarms to build, deploy, and operate a complete startup from PRD to revenue. Use when building complete startup systems, orchestrating multiple AI agents, automating full-stack development, or managing complex multi-agent workflows. Based on asklokesh/claudeskill-loki-mode.",
      "tags": [],
      "category": "AI-Agents",
      "keywords": [
        "across",
        "agent",
        "agents",
        "asklokesh",
        "automating",
        "autonomous",
        "based",
        "build",
        "building",
        "claudeskill"
      ]
    },
    {
      "name": "mcp-builder",
      "description": "Guide for creating high-quality MCP (Model Context Protocol) servers that enable LLMs to interact with external services through well-designed tools. Use when building MCP servers to integrate external APIs or services, whether in Python (FastMCP) or Node/TypeScript (MCP SDK).",
      "tags": [],
      "category": "AI-Agents",
      "keywords": [
        "apis",
        "builder",
        "building",
        "context",
        "creating",
        "designed",
        "enable",
        "external",
        "fastmcp",
        "guide"
      ]
    },
    {
      "name": "mcp-management",
      "description": "Manage Model Context Protocol (MCP) servers - discover, analyze, and execute tools/prompts/resources from configured MCP servers. Use when working with MCP integrations, need to discover available MCP capabilities, filter MCP tools for specific tasks, execute MCP tools programmatically, access MCP prompts/resources, or implement MCP client functionality. Supports intelligent tool selection,...",
      "tags": [],
      "category": "AI-Agents",
      "keywords": [
        "access",
        "analyze",
        "available",
        "capabilities",
        "capability",
        "client",
        "configured",
        "context",
        "discover",
        "discovery"
      ]
    },
    {
      "name": "ml-pipeline",
      "description": "Use when building ML pipelines, orchestrating training workflows, automating model lifecycle, implementing feature stores, or managing experiment tracking systems.",
      "tags": [],
      "category": "AI-Agents",
      "keywords": [
        "automating",
        "building",
        "experiment",
        "feature",
        "implementing",
        "lifecycle",
        "managing",
        "model",
        "orchestrating",
        "pipeline"
      ]
    },
    {
      "name": "prompt-engineer",
      "description": "Use when designing prompts for LLMs, optimizing model performance, building evaluation frameworks, or implementing advanced prompting techniques like chain-of-thought, few-shot learning, or structured outputs.",
      "tags": [],
      "category": "AI-Agents",
      "keywords": [
        "advanced",
        "building",
        "chain",
        "designing",
        "engineer",
        "evaluation",
        "few",
        "frameworks",
        "implementing",
        "learning"
      ]
    },
    {
      "name": "rag-pipeline-expert",
      "description": "Expert guidance for building complete RAG (Retrieval-Augmented Generation) pipelines with web scraping ingestion, vector databases, chunking strategies, and AI agent-based retrieval. Use when building RAG systems, implementing web scraping for knowledge bases, optimizing retrieval accuracy, choosing vector databases, configuring chunking strategies, or designing agentic retrieval patterns. Covers both pure Python/Docker...",
      "tags": [],
      "category": "AI-Agents",
      "keywords": [
        "accuracy",
        "agent",
        "agentic",
        "all",
        "augmented",
        "autogen",
        "balanced",
        "based",
        "bases",
        "both"
      ]
    },
    {
      "name": "responsiveness-check",
      "description": "Test website responsiveness across viewport widths using browser automation. Resizes a single session through breakpoints, screenshots each width, and detects layout transitions (column changes, nav switches, overflow). Produces comparison reports showing exactly where layouts break. Trigger with 'responsiveness check', 'check responsive', 'breakpoint test', 'viewport test', 'responsive sweep', 'check breakpoints', or...",
      "tags": [],
      "category": "AI-Agents",
      "keywords": [
        "across",
        "automation",
        "break",
        "breakpoint",
        "breakpoints",
        "browser",
        "changes",
        "check",
        "column",
        "comparison"
      ]
    },
    {
      "name": "senior-ml-engineer",
      "description": "ML engineering skill for productionizing models, building MLOps pipelines, and integrating LLMs. Covers model deployment, feature stores, drift monitoring, RAG systems, and cost optimization.",
      "tags": [],
      "category": "AI-Agents",
      "keywords": [
        "building",
        "cost",
        "covers",
        "deployment",
        "drift",
        "engineer",
        "engineering",
        "feature",
        "integrating",
        "llms"
      ]
    },
    {
      "name": "senior-prompt-engineer",
      "description": "This skill should be used when the user asks to \"optimize prompts\", \"design prompt templates\", \"evaluate LLM outputs\", \"build agentic systems\", \"implement RAG\", \"create few-shot examples\", \"analyze token usage\", or \"design AI workflows\". Use for prompt engineering patterns, LLM evaluation frameworks, agent architectures, and structured output design.",
      "tags": [],
      "category": "AI-Agents",
      "keywords": [
        "agent",
        "agentic",
        "analyze",
        "architectures",
        "asks",
        "build",
        "create",
        "design",
        "engineer",
        "engineering"
      ]
    },
    {
      "name": "atlassian-admin",
      "description": "Atlassian Administrator for managing and organizing Atlassian products, users, customization of the Atlassian suite, permissions, security, integrations, system configuration, and all administrative features. Use for user provisioning, global settings, security policies, system optimization, and org-wide Atlassian governance.",
      "tags": [],
      "category": "Automation",
      "keywords": [
        "admin",
        "administrative",
        "administrator",
        "all",
        "atlassian",
        "configuration",
        "customization",
        "features",
        "global",
        "governance"
      ]
    },
    {
      "name": "atlassian-mcp",
      "description": "Use when querying Jira issues, searching Confluence pages, creating tickets, updating documentation, or integrating Atlassian tools via MCP protocol.",
      "tags": [],
      "category": "Automation",
      "keywords": [
        "atlassian",
        "confluence",
        "creating",
        "documentation",
        "integrating",
        "issues",
        "jira",
        "mcp",
        "pages",
        "protocol"
      ]
    },
    {
      "name": "atlassian-templates",
      "description": "Atlassian Template and Files Creator/Modifier expert for creating, modifying, and managing Jira and Confluence templates, blueprints, custom layouts, reusable components, and standardized content structures. Use for building org-wide templates, custom blueprints, page layouts, and automated content generation.",
      "tags": [],
      "category": "Automation",
      "keywords": [
        "atlassian",
        "automated",
        "blueprints",
        "building",
        "components",
        "confluence",
        "content",
        "creating",
        "creator",
        "custom"
      ]
    },
    {
      "name": "confluence-expert",
      "description": "Atlassian Confluence expert for creating and managing spaces, knowledge bases, documentation, planning, product discovery, page layouts, macros, templates, and all Confluence features. Use for documentation strategy, space architecture, content organization, and collaborative knowledge management.",
      "tags": [],
      "category": "Automation",
      "keywords": [
        "all",
        "architecture",
        "atlassian",
        "bases",
        "collaborative",
        "confluence",
        "content",
        "creating",
        "discovery",
        "documentation"
      ]
    },
    {
      "name": "google-apps-script",
      "description": "Build Google Apps Script automation for Sheets and Workspace apps. Produces scripts with custom menus, triggers, dialogs, email automation, PDF export, and external API integration.",
      "tags": [],
      "category": "Automation",
      "keywords": [
        "api",
        "apps",
        "automation",
        "build",
        "custom",
        "dialogs",
        "email",
        "export",
        "external",
        "google"
      ]
    },
    {
      "name": "jira-expert",
      "description": "Atlassian Jira expert for creating and managing projects, planning, product discovery, JQL queries, workflows, custom fields, automation, reporting, and all Jira features. Use for Jira project setup, configuration, advanced search, dashboard creation, workflow design, and technical Jira operations.",
      "tags": [],
      "category": "Automation",
      "keywords": [
        "advanced",
        "all",
        "atlassian",
        "automation",
        "configuration",
        "creating",
        "creation",
        "custom",
        "dashboard",
        "design"
      ]
    },
    {
      "name": "n8n-code-javascript",
      "description": "Write JavaScript code in n8n Code nodes. Use when writing JavaScript in n8n, using $input/$json/$node syntax, making HTTP requests with $helpers, working with dates using DateTime, troubleshooting Code node errors, or choosing between Code node modes.",
      "tags": [],
      "category": "Automation",
      "keywords": [
        "between",
        "choosing",
        "code",
        "dates",
        "datetime",
        "errors",
        "helpers",
        "http",
        "input",
        "javascript"
      ]
    },
    {
      "name": "n8n-code-python",
      "description": "Write Python code in n8n Code nodes. Use when writing Python in n8n, using _input/_json/_node syntax, working with standard library, or need to understand Python limitations in n8n Code nodes.",
      "tags": [],
      "category": "Automation",
      "keywords": [
        "code",
        "library",
        "limitations",
        "n8n",
        "need",
        "nodes",
        "python",
        "standard",
        "syntax",
        "understand"
      ]
    },
    {
      "name": "n8n-expression-syntax",
      "description": "Validate n8n expression syntax and fix common errors. Use when writing n8n expressions, using {{}} syntax, accessing $json/$node variables, troubleshooting expression errors, or working with webhook data in workflows.",
      "tags": [],
      "category": "Automation",
      "keywords": [
        "accessing",
        "common",
        "data",
        "errors",
        "expression",
        "expressions",
        "fix",
        "json",
        "n8n",
        "node"
      ]
    },
    {
      "name": "n8n-mcp-tools-expert",
      "description": "Expert guide for using n8n-mcp MCP tools effectively. Use when searching for nodes, validating configurations, accessing templates, managing workflows, or using any n8n-mcp tool. Provides tool selection guidance, parameter formats, and common patterns.",
      "tags": [],
      "category": "Automation",
      "keywords": [
        "accessing",
        "any",
        "common",
        "configurations",
        "effectively",
        "expert",
        "formats",
        "guidance",
        "guide",
        "managing"
      ]
    },
    {
      "name": "n8n-node-configuration",
      "description": "Operation-aware node configuration guidance. Use when configuring nodes, understanding property dependencies, determining required fields, choosing between get_node detail levels, or learning common configuration patterns by node type.",
      "tags": [],
      "category": "Automation",
      "keywords": [
        "aware",
        "between",
        "choosing",
        "common",
        "configuration",
        "configuring",
        "dependencies",
        "detail",
        "determining",
        "fields"
      ]
    },
    {
      "name": "n8n-validation-expert",
      "description": "Interpret validation errors and guide fixing them. Use when encountering validation errors, validation warnings, false positives, operator structure issues, or need help understanding validation results. Also use when asking about validation profiles, error types, or the validation loop process.",
      "tags": [],
      "category": "Automation",
      "keywords": [
        "about",
        "also",
        "asking",
        "encountering",
        "error",
        "errors",
        "expert",
        "false",
        "fixing",
        "guide"
      ]
    },
    {
      "name": "n8n-workflow-patterns",
      "description": "Proven workflow architectural patterns from real n8n workflows. Use when building new workflows, designing workflow structure, choosing workflow patterns, planning workflow architecture, or asking about webhook processing, HTTP API integration, database operations, AI agent workflows, or scheduled tasks.",
      "tags": [],
      "category": "Automation",
      "keywords": [
        "about",
        "agent",
        "api",
        "architectural",
        "architecture",
        "asking",
        "building",
        "choosing",
        "database",
        "designing"
      ]
    },
    {
      "name": "playwright-expert",
      "description": "Use when writing E2E tests with Playwright, setting up test infrastructure, or debugging flaky browser tests. Invoke for browser automation, E2E tests, Page Object Model, test flakiness, visual testing.",
      "tags": [],
      "category": "Automation",
      "keywords": [
        "automation",
        "browser",
        "debugging",
        "expert",
        "flakiness",
        "flaky",
        "infrastructure",
        "invoke",
        "model",
        "object"
      ]
    },
    {
      "name": "test-master",
      "description": "Use when writing tests, creating test strategies, or building automation frameworks. Invoke for unit tests, integration tests, E2E, coverage analysis, performance testing, security testing.",
      "tags": [],
      "category": "Automation",
      "keywords": [
        "analysis",
        "automation",
        "building",
        "coverage",
        "creating",
        "frameworks",
        "integration",
        "invoke",
        "master",
        "performance"
      ]
    },
    {
      "name": "web-testing",
      "description": "Web testing with Playwright, Vitest, k6. E2E/unit/integration/load/security/visual/a11y testing. Use for test automation, flakiness, Core Web Vitals, mobile gestures, cross-browser.",
      "tags": [],
      "category": "Automation",
      "keywords": [
        "automation",
        "browser",
        "core",
        "cross",
        "flakiness",
        "gestures",
        "integration",
        "load",
        "mobile",
        "playwright"
      ]
    },
    {
      "name": "agile-product-owner",
      "description": "Agile product ownership for backlog management and sprint execution. Covers user story writing, acceptance criteria, sprint planning, and velocity tracking. Use for writing user stories, creating acceptance criteria, planning sprints, estimating story points, breaking down epics, or prioritizing backlog.",
      "tags": [],
      "category": "Business-Operations",
      "keywords": [
        "acceptance",
        "agile",
        "backlog",
        "breaking",
        "covers",
        "creating",
        "criteria",
        "down",
        "epics",
        "estimating"
      ]
    },
    {
      "name": "app-store-optimization",
      "description": "App Store Optimization toolkit for researching keywords, optimizing metadata, and tracking mobile app performance on Apple App Store and Google Play Store.",
      "tags": [],
      "category": "Business-Operations",
      "keywords": [
        "app",
        "apple",
        "google",
        "keywords",
        "metadata",
        "mobile",
        "optimization",
        "optimizing",
        "performance",
        "play"
      ]
    },
    {
      "name": "ceo-advisor",
      "description": "Executive leadership guidance for strategic decision-making, organizational development, and stakeholder management. Includes strategy analyzer, financial scenario modeling, board governance frameworks, and investor relations playbooks. Use when planning strategy, preparing board presentations, managing investors, developing organizational culture, making executive decisions, or when user mentions CEO, strategic planning, board meetings, investor updates,...",
      "tags": [],
      "category": "Business-Operations",
      "keywords": [
        "advisor",
        "analyzer",
        "board",
        "ceo",
        "culture",
        "decision",
        "decisions",
        "developing",
        "development",
        "executive"
      ]
    },
    {
      "name": "cto-advisor",
      "description": "Technical leadership guidance for engineering teams, architecture decisions, and technology strategy. Includes tech debt analyzer, team scaling calculator, engineering metrics frameworks, technology evaluation tools, and ADR templates. Use when assessing technical debt, scaling engineering teams, evaluating technologies, making architecture decisions, establishing engineering metrics, or when user mentions CTO, tech debt,...",
      "tags": [],
      "category": "Business-Operations",
      "keywords": [
        "adr",
        "advisor",
        "analyzer",
        "architecture",
        "assessing",
        "calculator",
        "cto",
        "debt",
        "decisions",
        "dora"
      ]
    },
    {
      "name": "customer-success-manager",
      "description": "Monitors customer health, predicts churn risk, and identifies expansion opportunities using weighted scoring models for SaaS customer success",
      "tags": [],
      "category": "Business-Operations",
      "keywords": [
        "churn",
        "customer",
        "expansion",
        "health",
        "identifies",
        "manager",
        "models",
        "monitors",
        "opportunities",
        "predicts"
      ]
    },
    {
      "name": "marketing-demand-acquisition",
      "description": "Multi-channel demand generation, paid media optimization, SEO strategy, and partnership programs for Series A+ startups",
      "tags": [],
      "category": "Business-Operations",
      "keywords": [
        "acquisition",
        "channel",
        "demand",
        "generation",
        "marketing",
        "media",
        "multi",
        "optimization",
        "paid",
        "partnership"
      ]
    },
    {
      "name": "marketing-strategy-pmm",
      "description": "Product marketing skill for positioning, GTM strategy, competitive intelligence, and product launches. Covers April Dunford positioning, ICP definition, competitive battlecards, launch playbooks, and international market entry.",
      "tags": [],
      "category": "Business-Operations",
      "keywords": [
        "april",
        "battlecards",
        "competitive",
        "covers",
        "definition",
        "dunford",
        "entry",
        "gtm",
        "icp",
        "intelligence"
      ]
    },
    {
      "name": "product-manager-toolkit",
      "description": "Comprehensive toolkit for product managers including RICE prioritization, customer interview analysis, PRD templates, discovery frameworks, and go-to-market strategies. Use for feature prioritization, user research synthesis, requirement documentation, and product strategy development.",
      "tags": [],
      "category": "Business-Operations",
      "keywords": [
        "analysis",
        "comprehensive",
        "customer",
        "development",
        "discovery",
        "documentation",
        "feature",
        "frameworks",
        "including",
        "interview"
      ]
    },
    {
      "name": "product-strategist",
      "description": "Strategic product leadership toolkit for Head of Product including OKR cascade generation, market analysis, vision setting, and team scaling. Use for strategic planning, goal alignment, competitive analysis, and organizational design.",
      "tags": [],
      "category": "Business-Operations",
      "keywords": [
        "alignment",
        "analysis",
        "cascade",
        "competitive",
        "design",
        "generation",
        "goal",
        "head",
        "including",
        "leadership"
      ]
    },
    {
      "name": "project-health",
      "description": "All-in-one project configuration and health management. Sets up new projects (settings.local.json, CLAUDE.md, .gitignore), audits existing projects (permissions, context quality, MCP coverage, leaked secrets, stale docs), tidies accumulated cruft, captures session learnings, and adds permission presets. Uses sub-agents for heavy analysis to keep main context clean. Trigger with 'project health', 'check...",
      "tags": [],
      "category": "Business-Operations",
      "keywords": [
        "accumulated",
        "add",
        "adds",
        "agents",
        "all",
        "analysis",
        "audit",
        "audits",
        "bootstrap",
        "capture"
      ]
    },
    {
      "name": "revenue-operations",
      "description": "Analyzes pipeline coverage, tracks forecast accuracy with MAPE, and calculates GTM efficiency metrics for SaaS revenue optimization",
      "tags": [],
      "category": "Business-Operations",
      "keywords": [
        "accuracy",
        "analyzes",
        "calculates",
        "coverage",
        "efficiency",
        "forecast",
        "gtm",
        "mape",
        "metrics",
        "operations"
      ]
    },
    {
      "name": "sales-engineer",
      "description": "Analyzes RFP responses for coverage gaps, builds competitive feature matrices, and plans proof-of-concept engagements for pre-sales engineering",
      "tags": [],
      "category": "Business-Operations",
      "keywords": [
        "analyzes",
        "builds",
        "competitive",
        "concept",
        "coverage",
        "engagements",
        "engineer",
        "engineering",
        "feature",
        "gaps"
      ]
    },
    {
      "name": "scrum-master",
      "description": "Advanced Scrum Master with data-driven team health analysis, velocity forecasting, retrospective insights, and team development expertise. Features comprehensive sprint health scoring, Monte Carlo forecasting, and psychological safety frameworks for high-performing agile teams.",
      "tags": [],
      "category": "Business-Operations",
      "keywords": [
        "advanced",
        "agile",
        "analysis",
        "carlo",
        "comprehensive",
        "data",
        "development",
        "driven",
        "expertise",
        "features"
      ]
    },
    {
      "name": "senior-pm",
      "description": "Senior Project Manager for enterprise software, SaaS, and digital transformation projects. Specializes in portfolio management, quantitative risk analysis, resource optimization, stakeholder alignment, and executive reporting. Uses advanced methodologies including EMV analysis, Monte Carlo simulation, WSJF prioritization, and multi-dimensional health scoring.",
      "tags": [],
      "category": "Business-Operations",
      "keywords": [
        "advanced",
        "alignment",
        "analysis",
        "carlo",
        "digital",
        "dimensional",
        "emv",
        "enterprise",
        "executive",
        "health"
      ]
    },
    {
      "name": "seo-local-business",
      "description": "Generate complete SEO setup for local business websites — HTML head tags, JSON-LD LocalBusiness schema, robots.txt, sitemap.xml. Australian-optimised with +61 phone, ABN, suburb patterns.",
      "tags": [],
      "category": "Business-Operations",
      "keywords": [
        "abn",
        "australian",
        "business",
        "complete",
        "generate",
        "head",
        "html",
        "json",
        "local",
        "localbusiness"
      ]
    },
    {
      "name": "aussie-business-english",
      "description": "Australian business English writing style for professional communications. Warm, direct, EN-AU spelling. Use when writing emails, chat messages, proposals, client communications, or any business writing for Australian SME audiences. Applies to drafting, editing, and tone-checking any professional text.",
      "tags": [],
      "category": "Communication",
      "keywords": [
        "any",
        "applies",
        "audiences",
        "aussie",
        "australian",
        "business",
        "chat",
        "checking",
        "client",
        "communications"
      ]
    },
    {
      "name": "brand-guidelines",
      "description": "Applies Anthropic's official brand colors and typography to any sort of artifact that may benefit from having Anthropic's look-and-feel. Use it when brand colors or style guidelines, visual formatting, or company design standards apply.",
      "tags": [],
      "category": "Communication",
      "keywords": [
        "anthropic",
        "any",
        "applies",
        "apply",
        "artifact",
        "benefit",
        "brand",
        "colors",
        "company",
        "design"
      ]
    },
    {
      "name": "content-creator",
      "description": "Create SEO-optimized marketing content with consistent brand voice. Includes brand voice analyzer, SEO optimizer, content frameworks, and social media templates. Use when writing blog posts, creating social media content, analyzing brand voice, optimizing SEO, planning content calendars, or when user mentions content creation, brand voice, SEO optimization, social media marketing,...",
      "tags": [],
      "category": "Communication",
      "keywords": [
        "analyzer",
        "analyzing",
        "blog",
        "brand",
        "calendars",
        "consistent",
        "content",
        "create",
        "creating",
        "creation"
      ]
    },
    {
      "name": "doc-coauthoring",
      "description": "Guide users through a structured workflow for co-authoring documentation. Use when user wants to write documentation, proposals, technical specs, decision docs, or similar structured content. This workflow helps users efficiently transfer context, refine content through iteration, and verify the doc works for readers. Trigger when user mentions writing docs, creating...",
      "tags": [],
      "category": "Communication",
      "keywords": [
        "authoring",
        "coauthoring",
        "content",
        "context",
        "creating",
        "decision",
        "doc",
        "docs",
        "documentation",
        "drafting"
      ]
    },
    {
      "name": "docs-seeker",
      "description": "Searching internet for technical documentation using llms.txt standard, GitHub repositories via Repomix, and parallel exploration. Use when user needs: (1) Latest documentation for libraries/frameworks, (2) Documentation in llms.txt format, (3) GitHub repository analysis, (4) Documentation without direct llms.txt support, (5) Multiple documentation sources in parallel",
      "tags": [],
      "category": "Communication",
      "keywords": [
        "analysis",
        "direct",
        "docs",
        "documentation",
        "exploration",
        "format",
        "frameworks",
        "github",
        "internet",
        "latest"
      ]
    },
    {
      "name": "internal-comms",
      "description": "A set of resources to help me write all kinds of internal communications, using the formats that my company likes to use. Claude should use this skill whenever asked to write some sort of internal communications (status reports, leadership updates, 3P updates, company newsletters, FAQs, incident reports, project updates, etc.).",
      "tags": [],
      "category": "Communication",
      "keywords": [
        "all",
        "asked",
        "claude",
        "comms",
        "communications",
        "company",
        "etc",
        "faqs",
        "formats",
        "help"
      ]
    },
    {
      "name": "shopify-content",
      "description": "Create and manage Shopify pages, blog posts, navigation, and SEO metadata. Workflow: determine content type, generate content, create via API or browser, verify. Use when creating pages, writing blog posts, updating navigation menus, managing redirects, or updating SEO metadata on a Shopify store.\n",
      "tags": [],
      "category": "Communication",
      "keywords": [
        "api",
        "blog",
        "browser",
        "content",
        "create",
        "creating",
        "determine",
        "generate",
        "manage",
        "managing"
      ]
    },
    {
      "name": "social-media-analyzer",
      "description": "Social media campaign analysis and performance tracking. Calculates engagement rates, ROI, and benchmarks across platforms. Use for analyzing social media performance, calculating engagement rate, measuring campaign ROI, comparing platform metrics, or benchmarking against industry standards.",
      "tags": [],
      "category": "Communication",
      "keywords": [
        "across",
        "against",
        "analysis",
        "analyzer",
        "analyzing",
        "benchmarking",
        "benchmarks",
        "calculates",
        "calculating",
        "campaign"
      ]
    },
    {
      "name": "wordpress-content",
      "description": "Create and manage WordPress posts, pages, media, categories, and menus. Workflow: determine content type, choose method (WP-CLI or REST API), execute, verify. Use when creating blog posts, updating pages, uploading media, managing categories and tags, updating menus, or doing bulk content operations on WordPress sites.\n",
      "tags": [],
      "category": "Communication",
      "keywords": [
        "api",
        "blog",
        "bulk",
        "categories",
        "choose",
        "cli",
        "content",
        "create",
        "creating",
        "determine"
      ]
    },
    {
      "name": "capa-officer",
      "description": "CAPA system management for medical device QMS. Covers root cause analysis, corrective action planning, effectiveness verification, and CAPA metrics. Use for CAPA investigations, 5-Why analysis, fishbone diagrams, root cause determination, corrective action tracking, effectiveness verification, or CAPA program optimization.",
      "tags": [],
      "category": "Compliance-Regulatory",
      "keywords": [
        "action",
        "analysis",
        "capa",
        "cause",
        "corrective",
        "covers",
        "determination",
        "device",
        "diagrams",
        "effectiveness"
      ]
    },
    {
      "name": "fda-consultant-specialist",
      "description": "FDA regulatory consultant for medical device companies. Provides 510(k)/PMA/De Novo pathway guidance, QSR (21 CFR 820) compliance, HIPAA assessments, and device cybersecurity. Use when user mentions FDA submission, 510(k), PMA, De Novo, QSR, premarket, predicate device, substantial equivalence, HIPAA medical device, or FDA cybersecurity.",
      "tags": [],
      "category": "Compliance-Regulatory",
      "keywords": [
        "assessments",
        "cfr",
        "companies",
        "compliance",
        "consultant",
        "cybersecurity",
        "device",
        "equivalence",
        "fda",
        "guidance"
      ]
    },
    {
      "name": "mdr-745-specialist",
      "description": "EU MDR 2017/745 compliance specialist for medical device classification, technical documentation, clinical evidence, and post-market surveillance. Covers Annex VIII classification rules, Annex II/III technical files, Annex XIV clinical evaluation, and EUDAMED integration.",
      "tags": [],
      "category": "Compliance-Regulatory",
      "keywords": [
        "745",
        "annex",
        "classification",
        "clinical",
        "compliance",
        "covers",
        "device",
        "documentation",
        "eudamed",
        "evaluation"
      ]
    },
    {
      "name": "qms-audit-expert",
      "description": "ISO 13485 internal audit expertise for medical device QMS. Covers audit planning, execution, nonconformity classification, and CAPA verification. Use for internal audit planning, audit execution, finding classification, external audit preparation, or audit program management.",
      "tags": [],
      "category": "Compliance-Regulatory",
      "keywords": [
        "audit",
        "capa",
        "classification",
        "covers",
        "device",
        "execution",
        "expert",
        "expertise",
        "external",
        "finding"
      ]
    },
    {
      "name": "quality-documentation-manager",
      "description": "Document control system management for medical device QMS. Covers document numbering, version control, change management, and 21 CFR Part 11 compliance. Use for document control procedures, change control workflow, document numbering, version management, electronic signature compliance, or regulatory documentation review.",
      "tags": [],
      "category": "Compliance-Regulatory",
      "keywords": [
        "cfr",
        "change",
        "compliance",
        "control",
        "covers",
        "device",
        "document",
        "documentation",
        "electronic",
        "management"
      ]
    },
    {
      "name": "quality-manager-qmr",
      "description": "Senior Quality Manager Responsible Person (QMR) for HealthTech and MedTech companies. Provides quality system governance, management review leadership, regulatory compliance oversight, and quality performance monitoring per ISO 13485 Clause 5.5.2.",
      "tags": [],
      "category": "Compliance-Regulatory",
      "keywords": [
        "clause",
        "companies",
        "compliance",
        "governance",
        "healthtech",
        "iso",
        "leadership",
        "management",
        "manager",
        "medtech"
      ]
    },
    {
      "name": "quality-manager-qms-iso13485",
      "description": "ISO 13485 Quality Management System implementation and maintenance for medical device organizations. Provides QMS design, documentation control, internal auditing, CAPA management, and certification support.",
      "tags": [],
      "category": "Compliance-Regulatory",
      "keywords": [
        "auditing",
        "capa",
        "certification",
        "control",
        "design",
        "device",
        "documentation",
        "implementation",
        "internal",
        "iso"
      ]
    },
    {
      "name": "regulatory-affairs-head",
      "description": "Senior Regulatory Affairs Manager for HealthTech and MedTech companies. Provides regulatory strategy development, submission management, pathway analysis, global compliance coordination, and cross-functional team leadership.",
      "tags": [],
      "category": "Compliance-Regulatory",
      "keywords": [
        "affairs",
        "analysis",
        "companies",
        "compliance",
        "coordination",
        "cross",
        "development",
        "functional",
        "global",
        "head"
      ]
    },
    {
      "name": "aesthetic",
      "description": "Create aesthetically beautiful interfaces following proven design principles. Use when building UI/UX, analyzing designs from inspiration sites, generating design images with ai-multimodal, implementing visual hierarchy and color theory, adding micro-interactions, or creating design documentation. Includes workflows for capturing and analyzing inspiration screenshots with chrome-devtools and ai-multimodal, iterative design image generation...",
      "tags": [],
      "category": "Design-Creative",
      "keywords": [
        "accessibility",
        "adding",
        "aesthetic",
        "aesthetically",
        "analyzing",
        "beautiful",
        "building",
        "capturing",
        "chrome",
        "color"
      ]
    },
    {
      "name": "algorithmic-art",
      "description": "Creating algorithmic art using p5.js with seeded randomness and interactive parameter exploration. Use this when users request creating art using code, generative art, algorithmic art, flow fields, or particle systems. Create original algorithmic art rather than copying existing artists' work to avoid copyright violations.",
      "tags": [],
      "category": "Design-Creative",
      "keywords": [
        "algorithmic",
        "art",
        "artists",
        "avoid",
        "code",
        "copying",
        "copyright",
        "create",
        "creating",
        "existing"
      ]
    },
    {
      "name": "canvas-design",
      "description": "Create beautiful visual art in .png and .pdf documents using design philosophy. You should use this skill when the user asks to create a poster, piece of art, design, or other static piece. Create original visual designs, never copying existing artists' work to avoid copyright violations.",
      "tags": [],
      "category": "Design-Creative",
      "keywords": [
        "art",
        "artists",
        "asks",
        "avoid",
        "beautiful",
        "canvas",
        "copying",
        "copyright",
        "create",
        "design"
      ]
    },
    {
      "name": "claude-d3js-skill",
      "description": "Create data visualizations using d3.js for interactive charts, graphs, and data-driven visualizations. Use when creating interactive data visualizations, building charts and graphs, visualizing datasets, or creating data-driven art. Based on chrisvoncsefalvay/claude-d3js-skill.",
      "tags": [],
      "category": "Design-Creative",
      "keywords": [
        "art",
        "based",
        "building",
        "charts",
        "chrisvoncsefalvay",
        "claude",
        "create",
        "creating",
        "d3js",
        "data"
      ]
    },
    {
      "name": "color-palette",
      "description": "Generate complete, accessible colour palettes from a single brand hex. Produces 11-shade scale (50-950), semantic tokens, dark mode variants, and Tailwind v4 CSS output. Includes WCAG contrast checking. Use when setting up design systems, creating Tailwind themes, building brand colours from a hex value, or checking colour accessibility.",
      "tags": [],
      "category": "Design-Creative",
      "keywords": [
        "accessibility",
        "accessible",
        "brand",
        "building",
        "checking",
        "color",
        "colour",
        "colours",
        "complete",
        "contrast"
      ]
    },
    {
      "name": "favicon-gen",
      "description": "Generate custom favicons from logos, text, or brand colours. Produces all required formats: favicon.svg, favicon.ico, apple-touch-icon.png, icon-192/512.png, and web manifest. Use when initialising websites, replacing CMS default favicons, converting logos to favicons, creating branded icons from initials, or troubleshooting favicon not displaying, iOS black square, or missing manifest.",
      "tags": [],
      "category": "Design-Creative",
      "keywords": [
        "all",
        "apple",
        "black",
        "brand",
        "branded",
        "cms",
        "colours",
        "converting",
        "creating",
        "custom"
      ]
    },
    {
      "name": "frontend-design",
      "description": "Create distinctive, production-grade frontend interfaces with high design quality. Use this skill when the user asks to build web components, pages, or applications. Generates creative, polished code that avoids generic AI aesthetics.",
      "tags": [],
      "category": "Design-Creative",
      "keywords": [
        "aesthetics",
        "applications",
        "asks",
        "avoids",
        "build",
        "code",
        "components",
        "create",
        "creative",
        "design"
      ]
    },
    {
      "name": "frontend-design",
      "description": "Create distinctive, production-grade frontend interfaces with high design quality. Use this skill when the user asks to build web components, pages, artifacts, posters, or applications (examples include websites, landing pages, dashboards, React components, HTML/CSS layouts, or when styling/beautifying any web UI). Generates creative, polished code and UI design that avoids...",
      "tags": [],
      "category": "Design-Creative",
      "keywords": [
        "aesthetics",
        "any",
        "applications",
        "artifacts",
        "asks",
        "avoids",
        "beautifying",
        "build",
        "code",
        "components"
      ]
    },
    {
      "name": "icon-set-generator",
      "description": "Generate cohesive, project-specific SVG icon sets for websites and applications. Use this skill whenever the user needs custom icons, an icon set for a website or app, icons for a client project, or mentions needing SVG icons that look consistent together. Also trigger when the user describes a project and...",
      "tags": [],
      "category": "Design-Creative",
      "keywords": [
        "also",
        "any",
        "app",
        "applications",
        "assets",
        "building",
        "client",
        "cohesive",
        "consistent",
        "custom"
      ]
    },
    {
      "name": "shadcn-ui",
      "description": "Install and configure shadcn/ui components for React projects. Guides component selection, installation order, dependency management, customisation with semantic tokens, and common UI recipes (forms, data tables, navigation, modals). Use after tailwind-theme-builder has set up the theme infrastructure, when adding components, building forms, creating data tables, or setting up navigation.",
      "tags": [],
      "category": "Design-Creative",
      "keywords": [
        "adding",
        "after",
        "builder",
        "building",
        "common",
        "component",
        "components",
        "configure",
        "creating",
        "customisation"
      ]
    },
    {
      "name": "slack-gif-creator",
      "description": "Knowledge and utilities for creating animated GIFs optimized for Slack. Provides constraints, validation tools, and animation concepts. Use when users request animated GIFs for Slack like \"make me a GIF of X doing Y for Slack.\"",
      "tags": [],
      "category": "Design-Creative",
      "keywords": [
        "animated",
        "animation",
        "concepts",
        "constraints",
        "creating",
        "creator",
        "doing",
        "gif",
        "gifs",
        "knowledge"
      ]
    },
    {
      "name": "tailwind-theme-builder",
      "description": "Set up Tailwind v4 with shadcn/ui themed UI. Workflow: install dependencies, configure CSS variables with @theme inline, set up dark mode, verify. Use when initialising React projects with Tailwind v4, setting up shadcn/ui theming, or fixing colors not working, tw-animate-css errors, @theme inline dark mode conflicts, @apply breaking, v3 migration...",
      "tags": [],
      "category": "Design-Creative",
      "keywords": [
        "animate",
        "apply",
        "breaking",
        "builder",
        "colors",
        "configure",
        "conflicts",
        "css",
        "dark",
        "dependencies"
      ]
    },
    {
      "name": "the-fool",
      "description": "Use when challenging ideas, plans, decisions, or proposals using structured critical reasoning. Invoke to play devil's advocate, run a pre-mortem, red team, or audit evidence and assumptions.",
      "tags": [],
      "category": "Design-Creative",
      "keywords": [
        "advocate",
        "assumptions",
        "audit",
        "challenging",
        "critical",
        "decisions",
        "devil",
        "evidence",
        "fool",
        "ideas"
      ]
    },
    {
      "name": "theme-factory",
      "description": "Toolkit for styling artifacts with a theme. These artifacts can be slides, docs, reportings, HTML landing pages, etc. There are 10 pre-set themes with colors/fonts that you can apply to any artifact that has been creating, or can generate a new theme on-the-fly.",
      "tags": [],
      "category": "Design-Creative",
      "keywords": [
        "any",
        "apply",
        "artifact",
        "artifacts",
        "colors",
        "creating",
        "docs",
        "etc",
        "factory",
        "fly"
      ]
    },
    {
      "name": "threejs",
      "description": "Build 3D web apps with Three.js (WebGL/WebGPU). Use for 3D scenes, animations, custom shaders, PBR materials, VR/XR experiences, games, data visualizations, product configurators.",
      "tags": [],
      "category": "Design-Creative",
      "keywords": [
        "animations",
        "apps",
        "build",
        "configurators",
        "custom",
        "data",
        "experiences",
        "games",
        "materials",
        "pbr"
      ]
    },
    {
      "name": "ui-design-system",
      "description": "UI design system toolkit for Senior UI Designer including design token generation, component documentation, responsive design calculations, and developer handoff tools. Use for creating design systems, maintaining visual consistency, and facilitating design-dev collaboration.",
      "tags": [],
      "category": "Design-Creative",
      "keywords": [
        "calculations",
        "collaboration",
        "component",
        "consistency",
        "creating",
        "design",
        "designer",
        "dev",
        "developer",
        "documentation"
      ]
    },
    {
      "name": "ui-styling",
      "description": "Create beautiful, accessible user interfaces with shadcn/ui components (built on Radix UI + Tailwind), Tailwind CSS utility-first styling, and canvas-based visual designs. Use when building user interfaces, implementing design systems, creating responsive layouts, adding accessible components (dialogs, dropdowns, forms, tables), customizing themes and colors, implementing dark mode, generating visual designs...",
      "tags": [],
      "category": "Design-Creative",
      "keywords": [
        "accessible",
        "across",
        "adding",
        "applications",
        "based",
        "beautiful",
        "building",
        "built",
        "canvas",
        "colors"
      ]
    },
    {
      "name": "ux-audit",
      "description": "Run UX walkthroughs and QA sweeps on live web apps using browser automation. Walks through apps as a real user, flags friction points and usability issues, tests CRUD operations, and produces ranked audit reports. Trigger with 'ux audit', 'ux walkthrough', 'qa test', 'test the app', or 'check all pages'.",
      "tags": [],
      "category": "Design-Creative",
      "keywords": [
        "all",
        "app",
        "apps",
        "audit",
        "automation",
        "browser",
        "check",
        "crud",
        "flags",
        "friction"
      ]
    },
    {
      "name": "ux-researcher-designer",
      "description": "UX research and design toolkit for Senior UX Designer/Researcher including data-driven persona generation, journey mapping, usability testing frameworks, and research synthesis. Use for user research, persona creation, journey mapping, and design validation.",
      "tags": [],
      "category": "Design-Creative",
      "keywords": [
        "creation",
        "data",
        "design",
        "designer",
        "driven",
        "frameworks",
        "generation",
        "including",
        "journey",
        "mapping"
      ]
    },
    {
      "name": "web-asset-generator",
      "description": "Generates web assets like favicons, app icons, and social media images for web applications. Use when creating favicons, generating app icons, creating social media preview images, optimizing web assets, or preparing assets for deployment. Based on alonw0/web-asset-generator.",
      "tags": [],
      "category": "Design-Creative",
      "keywords": [
        "app",
        "applications",
        "asset",
        "assets",
        "based",
        "creating",
        "deployment",
        "favicons",
        "generates",
        "generating"
      ]
    },
    {
      "name": "web-design-methodology",
      "description": "Universal web design implementation methodology — BEM, responsive, accessibility, CSS architecture, spacing systems, dark mode. The HOW of building production-grade HTML/CSS.",
      "tags": [],
      "category": "Design-Creative",
      "keywords": [
        "accessibility",
        "architecture",
        "bem",
        "building",
        "css",
        "dark",
        "design",
        "grade",
        "how",
        "html"
      ]
    },
    {
      "name": "web-design-patterns",
      "description": "Design patterns for website sections — heroes, cards, CTAs, trust signals, testimonials. Principle-based patterns that avoid AI-generated aesthetics. Pair with web-design-methodology for implementation.",
      "tags": [],
      "category": "Design-Creative",
      "keywords": [
        "aesthetics",
        "avoid",
        "based",
        "cards",
        "ctas",
        "design",
        "generated",
        "heroes",
        "implementation",
        "methodology"
      ]
    },
    {
      "name": "angular-architect",
      "description": "Use when building Angular 17+ applications with standalone components or signals. Invoke for enterprise apps, RxJS patterns, NgRx state management, performance optimization, advanced routing.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "advanced",
        "angular",
        "applications",
        "apps",
        "architect",
        "building",
        "components",
        "enterprise",
        "invoke",
        "management"
      ]
    },
    {
      "name": "api-design-reviewer",
      "description": "No description available",
      "tags": [],
      "category": "Development",
      "keywords": [
        "api",
        "available",
        "description",
        "design",
        "reviewer"
      ]
    },
    {
      "name": "api-designer",
      "description": "Use when designing REST or GraphQL APIs, creating OpenAPI specifications, or planning API architecture. Invoke for resource modeling, versioning strategies, pagination patterns, error handling standards.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "api",
        "apis",
        "architecture",
        "creating",
        "designer",
        "designing",
        "error",
        "graphql",
        "handling",
        "invoke"
      ]
    },
    {
      "name": "architecture-designer",
      "description": "Use when designing new system architecture, reviewing existing designs, or making architectural decisions. Invoke for system design, architecture review, design patterns, ADRs, scalability planning.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "adrs",
        "architectural",
        "architecture",
        "decisions",
        "design",
        "designer",
        "designing",
        "designs",
        "existing",
        "invoke"
      ]
    },
    {
      "name": "aws-solution-architect",
      "description": "Design AWS architectures for startups using serverless patterns and IaC templates. Use when asked to design serverless architecture, create CloudFormation templates, optimize AWS costs, set up CI/CD pipelines, or migrate to AWS. Covers Lambda, API Gateway, DynamoDB, ECS, Aurora, and cost optimization.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "api",
        "architect",
        "architecture",
        "architectures",
        "asked",
        "aurora",
        "aws",
        "cloudformation",
        "cost",
        "costs"
      ]
    },
    {
      "name": "backend-development",
      "description": "Build robust backend systems with modern technologies (Node.js, Python, Go, Rust), frameworks (NestJS, FastAPI, Django), databases (PostgreSQL, MongoDB, Redis), APIs (REST, GraphQL, gRPC), authentication (OAuth 2.1, JWT), testing strategies, security best practices (OWASP Top 10), performance optimization, scalability patterns (microservices, caching, sharding), DevOps practices (Docker, Kubernetes, CI/CD), and monitoring. Use...",
      "tags": [],
      "category": "Development",
      "keywords": [
        "apis",
        "authentication",
        "backend",
        "best",
        "build",
        "building",
        "caching",
        "database",
        "databases",
        "designing"
      ]
    },
    {
      "name": "better-auth",
      "description": "Implement authentication and authorization with Better Auth - a framework-agnostic TypeScript authentication framework. Features include email/password authentication with verification, OAuth providers (Google, GitHub, Discord, etc.), two-factor authentication (TOTP, SMS), passkeys/WebAuthn support, session management, role-based access control (RBAC), rate limiting, and database adapters. Use when adding authentication to applications, implementing OAuth...",
      "tags": [],
      "category": "Development",
      "keywords": [
        "access",
        "adapters",
        "adding",
        "agnostic",
        "applications",
        "auth",
        "authentication",
        "authorization",
        "based",
        "better"
      ]
    },
    {
      "name": "cli-developer",
      "description": "Use when building CLI tools, implementing argument parsing, or adding interactive prompts. Invoke for CLI design, argument parsing, interactive prompts, progress indicators, shell completions.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "adding",
        "argument",
        "building",
        "cli",
        "completions",
        "design",
        "developer",
        "implementing",
        "indicators",
        "interactive"
      ]
    },
    {
      "name": "code-documenter",
      "description": "Use when adding docstrings, creating API documentation, or building documentation sites. Invoke for OpenAPI/Swagger specs, JSDoc, doc portals, tutorials, user guides.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "adding",
        "api",
        "building",
        "code",
        "creating",
        "doc",
        "docstrings",
        "documentation",
        "documenter",
        "guides"
      ]
    },
    {
      "name": "cpp-pro",
      "description": "Use when building C++ applications requiring modern C++20/23 features, template metaprogramming, or high-performance systems. Invoke for concepts, ranges, coroutines, SIMD optimization, memory management.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "applications",
        "building",
        "concepts",
        "coroutines",
        "cpp",
        "features",
        "high",
        "invoke",
        "management",
        "memory"
      ]
    },
    {
      "name": "csharp-developer",
      "description": "Use when building C# applications with .NET 8+, ASP.NET Core APIs, or Blazor web apps. Invoke for Entity Framework Core, minimal APIs, async patterns, CQRS with MediatR.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "apis",
        "applications",
        "apps",
        "asp",
        "async",
        "blazor",
        "building",
        "core",
        "cqrs",
        "csharp"
      ]
    },
    {
      "name": "database-designer",
      "description": "No description available",
      "tags": [],
      "category": "Development",
      "keywords": [
        "available",
        "database",
        "description",
        "designer"
      ]
    },
    {
      "name": "database-optimizer",
      "description": "Use when investigating slow queries, analyzing execution plans, or optimizing database performance. Invoke for index design, query rewrites, configuration tuning, partitioning strategies, lock contention resolution.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "analyzing",
        "configuration",
        "contention",
        "database",
        "design",
        "execution",
        "index",
        "investigating",
        "invoke",
        "lock"
      ]
    },
    {
      "name": "databases",
      "description": "Work with MongoDB (document database, BSON documents, aggregation pipelines, Atlas cloud) and PostgreSQL (relational database, SQL queries, psql CLI, pgAdmin). Use when designing database schemas, writing queries and aggregations, optimizing indexes for performance, performing database migrations, configuring replication and sharding, implementing backup and restore strategies, managing database users and permissions,...",
      "tags": [],
      "category": "Development",
      "keywords": [
        "administering",
        "aggregation",
        "aggregations",
        "analyzing",
        "atlas",
        "backup",
        "bson",
        "cli",
        "cloud",
        "configuring"
      ]
    },
    {
      "name": "dependency-auditor",
      "description": "No description available",
      "tags": [],
      "category": "Development",
      "keywords": [
        "auditor",
        "available",
        "dependency",
        "description"
      ]
    },
    {
      "name": "django-expert",
      "description": "Use when building Django web applications or REST APIs with Django REST Framework. Invoke for Django models, ORM optimization, DRF serializers, viewsets, authentication with JWT.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "apis",
        "applications",
        "authentication",
        "building",
        "django",
        "drf",
        "expert",
        "framework",
        "invoke",
        "jwt"
      ]
    },
    {
      "name": "dotnet-core-expert",
      "description": "Use when building .NET 8 applications with minimal APIs, clean architecture, or cloud-native microservices. Invoke for Entity Framework Core, CQRS with MediatR, JWT authentication, AOT compilation.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "aot",
        "apis",
        "applications",
        "architecture",
        "authentication",
        "building",
        "clean",
        "cloud",
        "compilation",
        "core"
      ]
    },
    {
      "name": "embedded-systems",
      "description": "Use when developing firmware for microcontrollers, implementing RTOS applications, or optimizing power consumption. Invoke for STM32, ESP32, FreeRTOS, bare-metal, power optimization, real-time systems.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "applications",
        "bare",
        "consumption",
        "developing",
        "embedded",
        "firmware",
        "freertos",
        "implementing",
        "invoke",
        "metal"
      ]
    },
    {
      "name": "fastapi-expert",
      "description": "Use when building high-performance async Python APIs with FastAPI and Pydantic V2. Invoke for async SQLAlchemy, JWT authentication, WebSockets, OpenAPI documentation.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "apis",
        "async",
        "authentication",
        "building",
        "documentation",
        "expert",
        "fastapi",
        "high",
        "invoke",
        "jwt"
      ]
    },
    {
      "name": "feature-forge",
      "description": "Use when defining new features, gathering requirements, or writing specifications. Invoke for feature definition, requirements gathering, user stories, EARS format specs.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "defining",
        "definition",
        "ears",
        "feature",
        "features",
        "forge",
        "format",
        "gathering",
        "invoke",
        "new"
      ]
    },
    {
      "name": "flutter-expert",
      "description": "Use when building cross-platform applications with Flutter 3+ and Dart. Invoke for widget development, Riverpod/Bloc state management, GoRouter navigation, platform-specific implementations, performance optimization.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "applications",
        "bloc",
        "building",
        "cross",
        "dart",
        "development",
        "expert",
        "flutter",
        "gorouter",
        "implementations"
      ]
    },
    {
      "name": "frontend-dev-guidelines",
      "description": "Frontend development guidelines for React/TypeScript applications. Modern patterns including Suspense, lazy loading, useSuspenseQuery, file organization with features directory, MUI v7 styling, TanStack Router, performance optimization, and TypeScript best practices. Use when creating components, pages, features, fetching data, styling, routing, or working with frontend code.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "applications",
        "best",
        "code",
        "components",
        "creating",
        "data",
        "dev",
        "development",
        "directory",
        "features"
      ]
    },
    {
      "name": "fullstack-guardian",
      "description": "Use when implementing features across frontend and backend, building APIs with UI, or creating end-to-end data flows. Invoke for feature implementation, API development, UI building, cross-stack work.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "across",
        "api",
        "apis",
        "backend",
        "building",
        "creating",
        "cross",
        "data",
        "development",
        "end"
      ]
    },
    {
      "name": "game-developer",
      "description": "Use when building game systems, implementing Unity/Unreal features, or optimizing game performance. Invoke for Unity, Unreal, game patterns, ECS, physics, networking, performance optimization.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "building",
        "developer",
        "ecs",
        "features",
        "game",
        "implementing",
        "invoke",
        "networking",
        "optimization",
        "optimizing"
      ]
    },
    {
      "name": "golang-pro",
      "description": "Use when building Go applications requiring concurrent programming, microservices architecture, or high-performance systems. Invoke for goroutines, channels, Go generics, gRPC integration.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "applications",
        "architecture",
        "building",
        "channels",
        "concurrent",
        "generics",
        "golang",
        "goroutines",
        "grpc",
        "high"
      ]
    },
    {
      "name": "graphql-architect",
      "description": "Use when designing GraphQL schemas, implementing Apollo Federation, or building real-time subscriptions. Invoke for schema design, resolvers with DataLoader, query optimization, federation directives.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "apollo",
        "architect",
        "building",
        "dataloader",
        "design",
        "designing",
        "directives",
        "federation",
        "graphql",
        "implementing"
      ]
    },
    {
      "name": "hono-api-scaffolder",
      "description": "Scaffold Hono API routes for Cloudflare Workers. Produces route files, middleware, typed bindings, Zod validation, error handling, and API_ENDPOINTS.md documentation. Use after a project is set up with cloudflare-worker-builder or vite-flare-starter, when you need to add API routes, create endpoints, or generate API documentation.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "add",
        "after",
        "api",
        "bindings",
        "builder",
        "cloudflare",
        "create",
        "documentation",
        "endpoints",
        "error"
      ]
    },
    {
      "name": "interview-system-designer",
      "description": "This skill should be used when the user asks to \"design interview processes\", \"create hiring pipelines\", \"calibrate interview loops\", \"generate interview questions\", \"design competency matrices\", \"analyze interviewer bias\", \"create scoring rubrics\", \"build question banks\", or \"optimize hiring systems\". Use for designing role-specific interview loops, competency assessments, and hiring calibration systems.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "analyze",
        "asks",
        "assessments",
        "banks",
        "bias",
        "build",
        "calibrate",
        "calibration",
        "competency",
        "create"
      ]
    },
    {
      "name": "ios-simulator-skill",
      "description": "iOS app building, navigation, and testing through automation. Uses semantic navigation on accessibility APIs to interact with iOS simulators by meaning, not pixel coordinates. Includes 21 production scripts for building, testing, navigation, accessibility audits, visual testing, and device lifecycle management. Works across different screen sizes and survives UI redesigns. Token...",
      "tags": [],
      "category": "Development",
      "keywords": [
        "accessibility",
        "across",
        "apis",
        "app",
        "applications",
        "apps",
        "audits",
        "automating",
        "automation",
        "based"
      ]
    },
    {
      "name": "java-architect",
      "description": "Use when building enterprise Java applications with Spring Boot 3.x, microservices, or reactive programming. Invoke for WebFlux, JPA optimization, Spring Security, cloud-native patterns.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "applications",
        "architect",
        "boot",
        "building",
        "cloud",
        "enterprise",
        "invoke",
        "java",
        "jpa",
        "microservices"
      ]
    },
    {
      "name": "javascript-pro",
      "description": "Use when building JavaScript applications with modern ES2023+ features, async patterns, or Node.js development. Invoke for vanilla JavaScript, browser APIs, performance optimization, module systems.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "apis",
        "applications",
        "async",
        "browser",
        "building",
        "development",
        "features",
        "invoke",
        "javascript",
        "modern"
      ]
    },
    {
      "name": "kotlin-specialist",
      "description": "Use when building Kotlin applications requiring coroutines, multiplatform development, or Android with Compose. Invoke for Flow API, KMP projects, Ktor servers, DSL design, sealed classes.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "android",
        "api",
        "applications",
        "building",
        "classes",
        "compose",
        "coroutines",
        "design",
        "development",
        "dsl"
      ]
    },
    {
      "name": "laravel-specialist",
      "description": "Use when building Laravel 10+ applications requiring Eloquent ORM, API resources, or queue systems. Invoke for Laravel models, Livewire components, Sanctum authentication, Horizon queues.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "api",
        "applications",
        "authentication",
        "building",
        "components",
        "eloquent",
        "horizon",
        "invoke",
        "laravel",
        "livewire"
      ]
    },
    {
      "name": "mcp-builder",
      "description": "Guide for creating high-quality MCP (Model Context Protocol) servers that enable LLMs to interact with external services through well-designed tools. Use when building MCP servers to integrate external APIs or services, whether in Python (FastMCP) or Node/TypeScript (MCP SDK).",
      "tags": [],
      "category": "Development",
      "keywords": [
        "apis",
        "builder",
        "building",
        "context",
        "creating",
        "designed",
        "enable",
        "external",
        "fastmcp",
        "guide"
      ]
    },
    {
      "name": "mcp-developer",
      "description": "Use when building MCP servers or clients that connect AI systems with external tools and data sources. Invoke for MCP protocol compliance, TypeScript/Python SDKs, resource providers, tool functions.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "building",
        "clients",
        "compliance",
        "connect",
        "data",
        "developer",
        "external",
        "functions",
        "invoke",
        "mcp"
      ]
    },
    {
      "name": "media-processing",
      "description": "Process multimedia files with FFmpeg (video/audio encoding, conversion, streaming, filtering, hardware acceleration) and ImageMagick (image manipulation, format conversion, batch processing, effects, composition). Use when converting media formats, encoding videos with specific codecs (H.264, H.265, VP9), resizing/cropping images, extracting audio from video, applying filters and effects, optimizing file sizes, creating streaming...",
      "tags": [],
      "category": "Development",
      "keywords": [
        "acceleration",
        "applying",
        "audio",
        "batch",
        "codecs",
        "complex",
        "composite",
        "composition",
        "conversion",
        "converting"
      ]
    },
    {
      "name": "mermaidjs-v11",
      "description": "Create diagrams and visualizations using Mermaid.js v11 syntax. Use when generating flowcharts, sequence diagrams, class diagrams, state diagrams, ER diagrams, Gantt charts, user journeys, timelines, architecture diagrams, or any of 24+ diagram types. Supports JavaScript API integration, CLI rendering to SVG/PNG/PDF, theming, configuration, and accessibility features. Essential for documentation, technical...",
      "tags": [],
      "category": "Development",
      "keywords": [
        "accessibility",
        "any",
        "api",
        "architecture",
        "charts",
        "class",
        "cli",
        "communication",
        "configuration",
        "create"
      ]
    },
    {
      "name": "migration-architect",
      "description": "No description available",
      "tags": [],
      "category": "Development",
      "keywords": [
        "architect",
        "available",
        "description",
        "migration"
      ]
    },
    {
      "name": "nestjs-expert",
      "description": "Use when building NestJS applications requiring modular architecture, dependency injection, or TypeScript backend development. Invoke for modules, controllers, services, DTOs, guards, interceptors, TypeORM/Prisma.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "applications",
        "architecture",
        "backend",
        "building",
        "controllers",
        "dependency",
        "development",
        "dtos",
        "expert",
        "guards"
      ]
    },
    {
      "name": "nextjs-developer",
      "description": "Use when building Next.js 14+ applications with App Router, server components, or server actions. Invoke for full-stack features, performance optimization, SEO implementation, production deployment.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "actions",
        "app",
        "applications",
        "building",
        "components",
        "deployment",
        "developer",
        "features",
        "full",
        "implementation"
      ]
    },
    {
      "name": "payment-integration",
      "description": "Integrate payments with SePay (VietQR), Polar, Stripe, Paddle (MoR subscriptions), Creem.io (licensing). Checkout, webhooks, subscriptions, QR codes, multi-provider orders.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "checkout",
        "codes",
        "creem",
        "integrate",
        "integration",
        "licensing",
        "mor",
        "multi",
        "orders",
        "paddle"
      ]
    },
    {
      "name": "php-pro",
      "description": "Use when building PHP applications with modern PHP 8.3+ features, Laravel, or Symfony frameworks. Invoke for strict typing, PHPStan level 9, async patterns with Swoole, PSR standards.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "applications",
        "async",
        "building",
        "features",
        "frameworks",
        "invoke",
        "laravel",
        "level",
        "modern",
        "patterns"
      ]
    },
    {
      "name": "playwright-skill",
      "description": "General-purpose browser automation using Playwright for UI verification, testing, and debugging web applications. Use when testing web applications, automating browser interactions, verifying UI elements, debugging frontend issues, or performing end-to-end testing. Based on lackeyjb/playwright-skill.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "applications",
        "automating",
        "automation",
        "based",
        "browser",
        "debugging",
        "elements",
        "end",
        "frontend",
        "general"
      ]
    },
    {
      "name": "postgres-pro",
      "description": "Use when optimizing PostgreSQL queries, configuring replication, or implementing advanced database features. Invoke for EXPLAIN analysis, JSONB operations, extension usage, VACUUM tuning, performance monitoring.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "advanced",
        "analysis",
        "configuring",
        "database",
        "explain",
        "extension",
        "features",
        "implementing",
        "invoke",
        "jsonb"
      ]
    },
    {
      "name": "python-pro",
      "description": "Use when building Python 3.11+ applications requiring type safety, async programming, or production-grade patterns. Invoke for type hints, pytest, async/await, dataclasses, mypy configuration.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "applications",
        "async",
        "await",
        "building",
        "configuration",
        "dataclasses",
        "grade",
        "hints",
        "invoke",
        "mypy"
      ]
    },
    {
      "name": "rag-architect",
      "description": "Use when building RAG systems, vector databases, or knowledge-grounded AI applications requiring semantic search, document retrieval, or context augmentation.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "applications",
        "architect",
        "augmentation",
        "building",
        "context",
        "databases",
        "document",
        "grounded",
        "knowledge",
        "rag"
      ]
    },
    {
      "name": "rails-expert",
      "description": "Use when building Rails 7+ web applications with Hotwire, real-time features, or background job processing. Invoke for Active Record optimization, Turbo Frames/Streams, Action Cable, Sidekiq.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "action",
        "active",
        "applications",
        "background",
        "building",
        "cable",
        "expert",
        "features",
        "frames",
        "hotwire"
      ]
    },
    {
      "name": "react-expert",
      "description": "Use when building React 18+ applications requiring component architecture, hooks patterns, or state management. Invoke for Server Components, performance optimization, Suspense boundaries, React 19 features.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "applications",
        "architecture",
        "boundaries",
        "building",
        "component",
        "components",
        "expert",
        "features",
        "hooks",
        "invoke"
      ]
    },
    {
      "name": "react-native-expert",
      "description": "Use when building cross-platform mobile applications with React Native or Expo. Invoke for navigation patterns, platform-specific code, native modules, FlatList optimization.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "applications",
        "building",
        "code",
        "cross",
        "expert",
        "expo",
        "flatlist",
        "invoke",
        "mobile",
        "modules"
      ]
    },
    {
      "name": "repomix",
      "description": "Package entire code repositories into single AI-friendly files using Repomix. Capabilities include pack codebases with customizable include/exclude patterns, generate multiple output formats (XML, Markdown, plain text), preserve file structure and context, optimize for AI consumption with token counting, filter by file types and directories, add custom headers and summaries. Use...",
      "tags": [],
      "category": "Development",
      "keywords": [
        "add",
        "analysis",
        "analyzing",
        "audits",
        "capabilities",
        "code",
        "codebases",
        "consumption",
        "context",
        "counting"
      ]
    },
    {
      "name": "rust-engineer",
      "description": "Use when building Rust applications requiring memory safety, systems programming, or zero-cost abstractions. Invoke for ownership patterns, lifetimes, traits, async/await with tokio.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "abstractions",
        "applications",
        "async",
        "await",
        "building",
        "cost",
        "engineer",
        "invoke",
        "lifetimes",
        "memory"
      ]
    },
    {
      "name": "salesforce-developer",
      "description": "Use when developing Salesforce applications, Apex code, Lightning Web Components, SOQL queries, triggers, integrations, or CRM customizations. Invoke for governor limits, bulk processing, platform events, Salesforce DX.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "apex",
        "applications",
        "bulk",
        "code",
        "components",
        "crm",
        "customizations",
        "developer",
        "developing",
        "events"
      ]
    },
    {
      "name": "senior-architect",
      "description": "This skill should be used when the user asks to \"design system architecture\", \"evaluate microservices vs monolith\", \"create architecture diagrams\", \"analyze dependencies\", \"choose a database\", \"plan for scalability\", \"make technical decisions\", or \"review system design\". Use for architecture decision records (ADRs), tech stack evaluation, system design reviews, dependency analysis, and...",
      "tags": [],
      "category": "Development",
      "keywords": [
        "adrs",
        "analysis",
        "analyze",
        "architect",
        "architecture",
        "ascii",
        "asks",
        "choose",
        "create",
        "database"
      ]
    },
    {
      "name": "senior-backend",
      "description": "This skill should be used when the user asks to \"design REST APIs\", \"optimize database queries\", \"implement authentication\", \"build microservices\", \"review backend code\", \"set up GraphQL\", \"handle database migrations\", or \"load test APIs\". Use for Node.js/Express/Fastify development, PostgreSQL optimization, API security, and backend architecture patterns.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "api",
        "apis",
        "architecture",
        "asks",
        "authentication",
        "backend",
        "build",
        "code",
        "database",
        "design"
      ]
    },
    {
      "name": "senior-devops",
      "description": "Comprehensive DevOps skill for CI/CD, infrastructure automation, containerization, and cloud platforms (AWS, GCP, Azure). Includes pipeline setup, infrastructure as code, deployment automation, and monitoring. Use when setting up pipelines, deploying applications, managing infrastructure, implementing monitoring, or optimizing deployment processes.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "applications",
        "automation",
        "aws",
        "azure",
        "cloud",
        "code",
        "comprehensive",
        "containerization",
        "deploying",
        "deployment"
      ]
    },
    {
      "name": "senior-frontend",
      "description": "Frontend development skill for React, Next.js, TypeScript, and Tailwind CSS applications. Use when building React components, optimizing Next.js performance, analyzing bundle sizes, scaffolding frontend projects, implementing accessibility, or reviewing frontend code quality.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "accessibility",
        "analyzing",
        "applications",
        "building",
        "bundle",
        "code",
        "components",
        "css",
        "development",
        "frontend"
      ]
    },
    {
      "name": "senior-fullstack",
      "description": "Fullstack development toolkit with project scaffolding for Next.js, FastAPI, MERN, and Django stacks, code quality analysis with security and complexity scoring, and stack selection guidance. Use when the user asks to \"scaffold a new project\", \"create a Next.js app\", \"set up FastAPI with React\", \"analyze code quality\", \"audit my codebase\",...",
      "tags": [],
      "category": "Development",
      "keywords": [
        "analysis",
        "analyze",
        "app",
        "asks",
        "audit",
        "boilerplate",
        "code",
        "codebase",
        "comparison",
        "complexity"
      ]
    },
    {
      "name": "senior-qa",
      "description": "This skill should be used when the user asks to \"generate tests\", \"write unit tests\", \"analyze test coverage\", \"scaffold E2E tests\", \"set up Playwright\", \"configure Jest\", \"implement testing patterns\", or \"improve test quality\". Use for React/Next.js testing with Jest, React Testing Library, and Playwright.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "analyze",
        "asks",
        "configure",
        "coverage",
        "generate",
        "implement",
        "improve",
        "jest",
        "library",
        "next"
      ]
    },
    {
      "name": "shopify",
      "description": "Build Shopify applications, extensions, and themes using GraphQL/REST APIs, Shopify CLI, Polaris UI components, and Liquid templating. Capabilities include app development with OAuth authentication, checkout UI extensions for customizing checkout flow, admin UI extensions for dashboard integration, POS extensions for retail, theme development with Liquid, webhook management, billing API integration,...",
      "tags": [],
      "category": "Development",
      "keywords": [
        "admin",
        "api",
        "apis",
        "app",
        "applications",
        "apps",
        "authentication",
        "billing",
        "build",
        "building"
      ]
    },
    {
      "name": "shopify-expert",
      "description": "Use when building Shopify themes, apps, custom storefronts, or e-commerce solutions. Invoke for Liquid templating, Storefront API, app development, checkout customization, Shopify Plus features.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "api",
        "app",
        "apps",
        "building",
        "checkout",
        "commerce",
        "custom",
        "customization",
        "development",
        "expert"
      ]
    },
    {
      "name": "shopify-products",
      "description": "Create and manage Shopify products via the Admin API. Workflow: gather product data, choose method (API or CSV), execute, verify. Use when adding products, bulk importing, updating variants, managing inventory, uploading product images, or assigning products to collections.\n",
      "tags": [],
      "category": "Development",
      "keywords": [
        "adding",
        "admin",
        "api",
        "assigning",
        "bulk",
        "choose",
        "collections",
        "create",
        "csv",
        "data"
      ]
    },
    {
      "name": "shopify-setup",
      "description": "Set up Shopify CLI auth and Admin API access for a store. Workflow: install CLI, authenticate, create custom app, store access token, verify. Use when connecting to a Shopify store, setting up API access, or troubleshooting auth issues with Shopify CLI or Admin API tokens.\n",
      "tags": [],
      "category": "Development",
      "keywords": [
        "access",
        "admin",
        "api",
        "app",
        "auth",
        "authenticate",
        "cli",
        "connecting",
        "create",
        "custom"
      ]
    },
    {
      "name": "spring-boot-engineer",
      "description": "Use when building Spring Boot 3.x applications, microservices, or reactive Java applications. Invoke for Spring Data JPA, Spring Security 6, WebFlux, Spring Cloud integration.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "applications",
        "boot",
        "building",
        "cloud",
        "data",
        "engineer",
        "integration",
        "invoke",
        "java",
        "jpa"
      ]
    },
    {
      "name": "sql-pro",
      "description": "Use when optimizing SQL queries, designing database schemas, or tuning database performance. Invoke for complex queries, window functions, CTEs, indexing strategies, query plan analysis.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "analysis",
        "complex",
        "ctes",
        "database",
        "designing",
        "functions",
        "indexing",
        "invoke",
        "optimizing",
        "performance"
      ]
    },
    {
      "name": "swift-expert",
      "description": "Use when building iOS/macOS applications with Swift 5.9+, SwiftUI, or async/await concurrency. Invoke for protocol-oriented programming, SwiftUI state management, actors, server-side Swift.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "actors",
        "applications",
        "async",
        "await",
        "building",
        "concurrency",
        "expert",
        "invoke",
        "ios",
        "macos"
      ]
    },
    {
      "name": "tech-debt-tracker",
      "description": "No description available",
      "tags": [],
      "category": "Development",
      "keywords": [
        "available",
        "debt",
        "description",
        "tech",
        "tracker"
      ]
    },
    {
      "name": "tech-stack-evaluator",
      "description": "Technology stack evaluation and comparison with TCO analysis, security assessment, and ecosystem health scoring. Use when comparing frameworks, evaluating technology stacks, calculating total cost of ownership, assessing migration paths, or analyzing ecosystem viability.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "analysis",
        "analyzing",
        "assessing",
        "assessment",
        "calculating",
        "comparing",
        "comparison",
        "cost",
        "ecosystem",
        "evaluating"
      ]
    },
    {
      "name": "typescript-pro",
      "description": "Use when building TypeScript applications requiring advanced type systems, generics, or full-stack type safety. Invoke for type guards, utility types, tRPC integration, monorepo setup.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "advanced",
        "applications",
        "building",
        "full",
        "generics",
        "guards",
        "integration",
        "invoke",
        "monorepo",
        "pro"
      ]
    },
    {
      "name": "vite-flare-starter",
      "description": "Scaffold a full-stack Cloudflare app from vite-flare-starter — React 19, Hono, D1+Drizzle, better-auth, Tailwind v4+shadcn/ui, TanStack Query, R2, Workers AI. Run setup.sh to clone, configure, and deploy.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "app",
        "auth",
        "better",
        "clone",
        "cloudflare",
        "configure",
        "deploy",
        "drizzle",
        "flare",
        "from"
      ]
    },
    {
      "name": "vue-expert",
      "description": "Use when building Vue 3 applications with Composition API, Nuxt 3, or Quasar. Invoke for Pinia, TypeScript, PWA, Capacitor mobile apps, Vite configuration.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "api",
        "applications",
        "apps",
        "building",
        "capacitor",
        "composition",
        "configuration",
        "expert",
        "invoke",
        "mobile"
      ]
    },
    {
      "name": "vue-expert-js",
      "description": "Use when building Vue 3 applications with JavaScript only (no TypeScript). Invoke for JSDoc typing, vanilla JS composables, .mjs modules.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "applications",
        "building",
        "composables",
        "expert",
        "invoke",
        "javascript",
        "jsdoc",
        "mjs",
        "modules",
        "only"
      ]
    },
    {
      "name": "web-artifacts-builder",
      "description": "Suite of tools for creating elaborate, multi-component claude.ai HTML artifacts using modern frontend web technologies (React, Tailwind CSS, shadcn/ui). Use for complex artifacts requiring state management, routing, or shadcn/ui components - not for simple single-file HTML/JSX artifacts.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "artifacts",
        "builder",
        "claude",
        "complex",
        "component",
        "components",
        "creating",
        "css",
        "elaborate",
        "file"
      ]
    },
    {
      "name": "web-frameworks",
      "description": "Build modern full-stack web applications with Next.js (App Router, Server Components, RSC, PPR, SSR, SSG, ISR), Turborepo (monorepo management, task pipelines, remote caching, parallel execution), and RemixIcon (3100+ SVG icons in outlined/filled styles). Use when creating React applications, implementing server-side rendering, setting up monorepos with multiple packages, optimizing build performance...",
      "tags": [],
      "category": "Development",
      "keywords": [
        "adding",
        "app",
        "applications",
        "build",
        "caching",
        "components",
        "creating",
        "dependencies",
        "execution",
        "filled"
      ]
    },
    {
      "name": "webapp-testing",
      "description": "Toolkit for interacting with and testing local web applications using Playwright. Supports verifying frontend functionality, debugging UI behavior, capturing browser screenshots, and viewing browser logs.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "applications",
        "behavior",
        "browser",
        "capturing",
        "debugging",
        "frontend",
        "functionality",
        "interacting",
        "local",
        "logs"
      ]
    },
    {
      "name": "websocket-engineer",
      "description": "Use when building real-time communication systems with WebSockets or Socket.IO. Invoke for bidirectional messaging, horizontal scaling with Redis, presence tracking, room management.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "bidirectional",
        "building",
        "communication",
        "engineer",
        "horizontal",
        "invoke",
        "management",
        "messaging",
        "presence",
        "real"
      ]
    },
    {
      "name": "wordpress-elementor",
      "description": "Edit Elementor pages and manage templates on WordPress sites. Workflow: identify page, choose editing method (browser or WP-CLI), execute, verify. Use when editing Elementor pages, updating text in Elementor widgets, applying or managing Elementor templates, or making content changes to pages built with Elementor page builder.\n",
      "tags": [],
      "category": "Development",
      "keywords": [
        "applying",
        "browser",
        "builder",
        "built",
        "changes",
        "choose",
        "cli",
        "content",
        "edit",
        "editing"
      ]
    },
    {
      "name": "wordpress-pro",
      "description": "Use when developing WordPress themes, plugins, customizing Gutenberg blocks, implementing WooCommerce features, or optimizing WordPress performance and security.",
      "tags": [],
      "category": "Development",
      "keywords": [
        "blocks",
        "customizing",
        "developing",
        "features",
        "gutenberg",
        "implementing",
        "optimizing",
        "performance",
        "plugins",
        "pro"
      ]
    },
    {
      "name": "wordpress-setup",
      "description": "Connect to a WordPress site via WP-CLI over SSH or REST API. Workflow: check CLI, test SSH connection, set up auth, verify access, save config. Use when connecting to a WordPress site, setting up WP-CLI access, creating application passwords, or troubleshooting WordPress connection issues.\n",
      "tags": [],
      "category": "Development",
      "keywords": [
        "access",
        "api",
        "application",
        "auth",
        "check",
        "cli",
        "config",
        "connect",
        "connecting",
        "connection"
      ]
    },
    {
      "name": "docx",
      "description": "Comprehensive document creation, editing, and analysis with support for tracked changes, comments, formatting preservation, and text extraction. When Claude needs to work with professional documents (.docx files) for: (1) Creating new documents, (2) Modifying or editing content, (3) Working with tracked changes, (4) Adding comments, or any other document tasks",
      "tags": [],
      "category": "Document-Generation",
      "keywords": [
        "adding",
        "analysis",
        "any",
        "changes",
        "claude",
        "comments",
        "comprehensive",
        "content",
        "creating",
        "creation"
      ]
    },
    {
      "name": "pdf",
      "description": "Comprehensive PDF manipulation toolkit for extracting text and tables, creating new PDFs, merging/splitting documents, and handling forms. When Claude needs to fill in a PDF form or programmatically process, generate, or analyze PDF documents at scale.",
      "tags": [],
      "category": "Document-Generation",
      "keywords": [
        "analyze",
        "claude",
        "comprehensive",
        "creating",
        "documents",
        "extracting",
        "fill",
        "form",
        "forms",
        "generate"
      ]
    },
    {
      "name": "pptx",
      "description": "Presentation creation, editing, and analysis. When Claude needs to work with presentations (.pptx files) for: (1) Creating new presentations, (2) Modifying or editing content, (3) Working with layouts, (4) Adding comments or speaker notes, or any other presentation tasks",
      "tags": [],
      "category": "Document-Generation",
      "keywords": [
        "adding",
        "analysis",
        "any",
        "claude",
        "comments",
        "content",
        "creating",
        "creation",
        "editing",
        "files"
      ]
    },
    {
      "name": "xlsx",
      "description": "Comprehensive spreadsheet creation, editing, and analysis with support for formulas, formatting, data analysis, and visualization. When Claude needs to work with spreadsheets (.xlsx, .xlsm, .csv, .tsv, etc) for: (1) Creating new spreadsheets with formulas and formatting, (2) Reading or analyzing data, (3) Modify existing spreadsheets while preserving formulas, (4) Data...",
      "tags": [],
      "category": "Document-Generation",
      "keywords": [
        "analysis",
        "analyzing",
        "claude",
        "comprehensive",
        "creating",
        "creation",
        "csv",
        "data",
        "editing",
        "etc"
      ]
    },
    {
      "name": "chaos-engineer",
      "description": "Use when designing chaos experiments, implementing failure injection frameworks, or conducting game day exercises. Invoke for chaos experiments, resilience testing, blast radius control, game days, antifragile systems.",
      "tags": [],
      "category": "Infrastructure-DevOps",
      "keywords": [
        "antifragile",
        "blast",
        "chaos",
        "conducting",
        "control",
        "day",
        "days",
        "designing",
        "engineer",
        "exercises"
      ]
    },
    {
      "name": "cloud-architect",
      "description": "Use when designing cloud architectures, planning migrations, or optimizing multi-cloud deployments. Invoke for Well-Architected Framework, cost optimization, disaster recovery, landing zones, security architecture, serverless design.",
      "tags": [],
      "category": "Infrastructure-DevOps",
      "keywords": [
        "architect",
        "architected",
        "architecture",
        "architectures",
        "cloud",
        "cost",
        "deployments",
        "design",
        "designing",
        "disaster"
      ]
    },
    {
      "name": "cloudflare-worker-builder",
      "description": "Scaffold and deploy Cloudflare Workers with Hono routing, Vite plugin, and Static Assets. Workflow: describe project, scaffold structure, configure bindings, deploy. Use when creating Workers projects, setting up Hono/Vite, configuring D1/R2/KV bindings, or troubleshooting export syntax errors, API route conflicts, HMR issues, or deployment failures.\n",
      "tags": [],
      "category": "Infrastructure-DevOps",
      "keywords": [
        "api",
        "assets",
        "bindings",
        "builder",
        "cloudflare",
        "configure",
        "configuring",
        "conflicts",
        "creating",
        "deploy"
      ]
    },
    {
      "name": "d1-drizzle-schema",
      "description": "Generate Drizzle ORM schemas for Cloudflare D1 databases with correct D1-specific patterns. Produces schema files, migration commands, type exports, and DATABASE_SCHEMA.md documentation. Handles D1 quirks: foreign keys always enforced, no native BOOLEAN/DATETIME types, 100 bound parameter limit, JSON stored as TEXT. Use when creating a new database, adding tables, or...",
      "tags": [],
      "category": "Infrastructure-DevOps",
      "keywords": [
        "adding",
        "always",
        "boolean",
        "bound",
        "cloudflare",
        "commands",
        "correct",
        "creating",
        "data",
        "database"
      ]
    },
    {
      "name": "devops",
      "description": "Deploy to Cloudflare (Workers, R2, D1), Docker, GCP (Cloud Run, GKE), Kubernetes (kubectl, Helm). Use for serverless, containers, CI/CD, GitOps, security audit.",
      "tags": [],
      "category": "Infrastructure-DevOps",
      "keywords": [
        "audit",
        "cloud",
        "cloudflare",
        "containers",
        "deploy",
        "devops",
        "docker",
        "gcp",
        "gitops",
        "gke"
      ]
    },
    {
      "name": "devops-engineer",
      "description": "Use when setting up CI/CD pipelines, containerizing applications, or managing infrastructure as code. Invoke for pipelines, Docker, Kubernetes, cloud platforms, GitOps.",
      "tags": [],
      "category": "Infrastructure-DevOps",
      "keywords": [
        "applications",
        "cloud",
        "code",
        "containerizing",
        "devops",
        "docker",
        "engineer",
        "gitops",
        "infrastructure",
        "invoke"
      ]
    },
    {
      "name": "docker-development-workflow",
      "description": "Docker development workflow patterns including local development setup with hot-reload, production Dockerfile optimization using multi-stage builds, docker-compose for dev/staging/prod environments, CI/CD pipeline configuration with GitHub Actions, image size reduction techniques (70-90% smaller), and release management strategies. Use when setting up local Docker development, optimizing container images, implementing CI/CD for containerized...",
      "tags": [],
      "category": "Infrastructure-DevOps",
      "keywords": [
        "actions",
        "apps",
        "builds",
        "compose",
        "configuration",
        "container",
        "containerized",
        "deployment",
        "dev",
        "development"
      ]
    },
    {
      "name": "github-release",
      "description": "Prepare and publish GitHub releases. Sanitizes code for public release (secrets scan, personal artifacts, LICENSE/README validation), creates version tags, and publishes via gh CLI. Trigger with 'release', 'publish', 'open source', 'prepare for release', 'create release', or 'github release'.",
      "tags": [],
      "category": "Infrastructure-DevOps",
      "keywords": [
        "artifacts",
        "cli",
        "code",
        "create",
        "creates",
        "github",
        "license",
        "open",
        "personal",
        "prepare"
      ]
    },
    {
      "name": "incident-commander",
      "description": "No description available",
      "tags": [],
      "category": "Infrastructure-DevOps",
      "keywords": [
        "available",
        "commander",
        "description",
        "incident"
      ]
    },
    {
      "name": "kubernetes-specialist",
      "description": "Use when deploying or managing Kubernetes workloads requiring cluster configuration, security hardening, or troubleshooting. Invoke for Helm charts, RBAC policies, NetworkPolicies, storage configuration, performance optimization.",
      "tags": [],
      "category": "Infrastructure-DevOps",
      "keywords": [
        "charts",
        "cluster",
        "configuration",
        "deploying",
        "hardening",
        "helm",
        "invoke",
        "kubernetes",
        "managing",
        "networkpolicies"
      ]
    },
    {
      "name": "legacy-modernizer",
      "description": "Use when modernizing legacy systems, implementing incremental migration strategies, or reducing technical debt. Invoke for strangler fig pattern, monolith decomposition, framework upgrades.",
      "tags": [],
      "category": "Infrastructure-DevOps",
      "keywords": [
        "debt",
        "decomposition",
        "fig",
        "framework",
        "implementing",
        "incremental",
        "invoke",
        "legacy",
        "migration",
        "modernizer"
      ]
    },
    {
      "name": "microservices-architect",
      "description": "Use when designing distributed systems, decomposing monoliths, or implementing microservices patterns. Invoke for service boundaries, DDD, saga patterns, event sourcing, service mesh, distributed tracing.",
      "tags": [],
      "category": "Infrastructure-DevOps",
      "keywords": [
        "architect",
        "boundaries",
        "ddd",
        "decomposing",
        "designing",
        "distributed",
        "event",
        "implementing",
        "invoke",
        "mesh"
      ]
    },
    {
      "name": "monitoring-expert",
      "description": "Use when setting up monitoring systems, logging, metrics, tracing, or alerting. Invoke for dashboards, Prometheus/Grafana, load testing, profiling, capacity planning.",
      "tags": [],
      "category": "Infrastructure-DevOps",
      "keywords": [
        "alerting",
        "capacity",
        "dashboards",
        "expert",
        "grafana",
        "invoke",
        "load",
        "logging",
        "metrics",
        "monitoring"
      ]
    },
    {
      "name": "observability-designer",
      "description": "No description available",
      "tags": [],
      "category": "Infrastructure-DevOps",
      "keywords": [
        "available",
        "description",
        "designer",
        "observability"
      ]
    },
    {
      "name": "release-manager",
      "description": "No description available",
      "tags": [],
      "category": "Infrastructure-DevOps",
      "keywords": [
        "available",
        "description",
        "manager",
        "release"
      ]
    },
    {
      "name": "sre-engineer",
      "description": "Use when defining SLIs/SLOs, managing error budgets, or building reliable systems at scale. Invoke for incident management, chaos engineering, toil reduction, capacity planning.",
      "tags": [],
      "category": "Infrastructure-DevOps",
      "keywords": [
        "budgets",
        "building",
        "capacity",
        "chaos",
        "defining",
        "engineer",
        "engineering",
        "error",
        "incident",
        "invoke"
      ]
    },
    {
      "name": "terraform-engineer",
      "description": "Use when implementing infrastructure as code with Terraform across AWS, Azure, or GCP. Invoke for module development, state management, provider configuration, multi-environment workflows, infrastructure testing.",
      "tags": [],
      "category": "Infrastructure-DevOps",
      "keywords": [
        "across",
        "aws",
        "azure",
        "code",
        "configuration",
        "development",
        "engineer",
        "environment",
        "gcp",
        "implementing"
      ]
    },
    {
      "name": "vps-daily-operations",
      "description": "VPS operational procedures including daily health checks, weekly maintenance, monitoring configuration, incident response, security hardening, and backup strategies. Use when setting up automated monitoring for Dokploy/Docker infrastructure, implementing SSH hardening with Fail2Ban, configuring backup routines, responding to incidents (disk full, OOM, compromised containers), or establishing operational runbooks. Includes ready-to-use bash...",
      "tags": [],
      "category": "Infrastructure-DevOps",
      "keywords": [
        "automated",
        "automation",
        "backup",
        "bash",
        "checks",
        "compromised",
        "configuration",
        "configuring",
        "containers",
        "cron"
      ]
    },
    {
      "name": "vps-deployment-stack",
      "description": "Deploy production-ready VPS infrastructure with Dokploy (PaaS), Traefik (reverse proxy with auto-TLS), Docker Compose, and Uptime Kuma (monitoring). Use when setting up a new VPS from scratch, configuring automatic HTTPS with Let's Encrypt, deploying Git-based applications with webhooks, or establishing monitoring infrastructure. Covers installation, DNS configuration, TLS setup, and validation...",
      "tags": [],
      "category": "Infrastructure-DevOps",
      "keywords": [
        "applications",
        "auto",
        "automatic",
        "based",
        "compose",
        "configuration",
        "configuring",
        "covers",
        "deploy",
        "deploying"
      ]
    },
    {
      "name": "Collision-Zone Thinking",
      "description": "Force unrelated concepts together to discover emergent properties - \"What if we treated X like Y?\"",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "collision",
        "concepts",
        "discover",
        "emergent",
        "force",
        "like",
        "properties",
        "together",
        "treated",
        "unrelated"
      ]
    },
    {
      "name": "Collision-Zone Thinking",
      "description": "Force unrelated concepts together to discover emergent properties - \"What if we treated X like Y?\"",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "collision",
        "concepts",
        "discover",
        "emergent",
        "force",
        "like",
        "properties",
        "together",
        "treated",
        "unrelated"
      ]
    },
    {
      "name": "Defense-in-Depth Validation",
      "description": "Validate at every layer data passes through to make bugs impossible",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "bugs",
        "data",
        "defense",
        "depth validation",
        "every",
        "impossible",
        "layer",
        "make",
        "passes",
        "through"
      ]
    },
    {
      "name": "Defense-in-Depth Validation",
      "description": "Validate at every layer data passes through to make bugs impossible",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "bugs",
        "data",
        "defense",
        "depth validation",
        "every",
        "impossible",
        "layer",
        "make",
        "passes",
        "through"
      ]
    },
    {
      "name": "Inversion Exercise",
      "description": "Flip core assumptions to reveal hidden constraints and alternative approaches - \"what if the opposite were true?\"",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "alternative",
        "approaches",
        "assumptions",
        "constraints",
        "core",
        "flip",
        "hidden",
        "inversion exercise",
        "opposite",
        "reveal"
      ]
    },
    {
      "name": "Inversion Exercise",
      "description": "Flip core assumptions to reveal hidden constraints and alternative approaches - \"what if the opposite were true?\"",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "alternative",
        "approaches",
        "assumptions",
        "constraints",
        "core",
        "flip",
        "hidden",
        "inversion exercise",
        "opposite",
        "reveal"
      ]
    },
    {
      "name": "Meta-Pattern Recognition",
      "description": "Spot patterns appearing in 3+ domains to find universal principles",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "appearing",
        "domains",
        "find",
        "meta",
        "pattern recognition",
        "patterns",
        "principles",
        "spot",
        "universal"
      ]
    },
    {
      "name": "Meta-Pattern Recognition",
      "description": "Spot patterns appearing in 3+ domains to find universal principles",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "appearing",
        "domains",
        "find",
        "meta",
        "pattern recognition",
        "patterns",
        "principles",
        "spot",
        "universal"
      ]
    },
    {
      "name": "Root Cause Tracing",
      "description": "Systematically trace bugs backward through call stack to find original trigger",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "backward",
        "bugs",
        "call",
        "find",
        "original",
        "root cause tracing",
        "stack",
        "systematically",
        "through",
        "trace"
      ]
    },
    {
      "name": "Root Cause Tracing",
      "description": "Systematically trace bugs backward through call stack to find original trigger",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "backward",
        "bugs",
        "call",
        "find",
        "original",
        "root cause tracing",
        "stack",
        "systematically",
        "through",
        "trace"
      ]
    },
    {
      "name": "Scale Game",
      "description": "Test at extremes (1000x bigger/smaller, instant/year-long) to expose fundamental truths hidden at normal scales",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "bigger",
        "expose",
        "extremes",
        "fundamental",
        "hidden",
        "instant",
        "long",
        "normal",
        "scale game",
        "scales"
      ]
    },
    {
      "name": "Scale Game",
      "description": "Test at extremes (1000x bigger/smaller, instant/year-long) to expose fundamental truths hidden at normal scales",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "bigger",
        "expose",
        "extremes",
        "fundamental",
        "hidden",
        "instant",
        "long",
        "normal",
        "scale game",
        "scales"
      ]
    },
    {
      "name": "Simplification Cascades",
      "description": "Find one insight that eliminates multiple components - \"if this is true, we don't need X, Y, or Z\"",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "components",
        "don",
        "eliminates",
        "find",
        "insight",
        "multiple",
        "need",
        "one",
        "simplification cascades",
        "that"
      ]
    },
    {
      "name": "Simplification Cascades",
      "description": "Find one insight that eliminates multiple components - \"if this is true, we don't need X, Y, or Z\"",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "components",
        "don",
        "eliminates",
        "find",
        "insight",
        "multiple",
        "need",
        "one",
        "simplification cascades",
        "that"
      ]
    },
    {
      "name": "Systematic Debugging",
      "description": "Four-phase debugging framework that ensures root cause investigation before attempting fixes. Never jump to solutions.",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "attempting",
        "before",
        "cause",
        "debugging",
        "ensures",
        "fixes",
        "four",
        "framework",
        "investigation",
        "jump"
      ]
    },
    {
      "name": "Systematic Debugging",
      "description": "Four-phase debugging framework that ensures root cause investigation before attempting fixes. Never jump to solutions.",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "attempting",
        "before",
        "cause",
        "debugging",
        "ensures",
        "fixes",
        "four",
        "framework",
        "investigation",
        "jump"
      ]
    },
    {
      "name": "Verification Before Completion",
      "description": "Run verification commands and confirm output before claiming success",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "before",
        "claiming",
        "commands",
        "confirm",
        "output",
        "run",
        "success",
        "verification",
        "verification before completion"
      ]
    },
    {
      "name": "Verification Before Completion",
      "description": "Run verification commands and confirm output before claiming success",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "before",
        "claiming",
        "commands",
        "confirm",
        "output",
        "run",
        "success",
        "verification",
        "verification before completion"
      ]
    },
    {
      "name": "When Stuck - Problem-Solving Dispatch",
      "description": "Dispatch to the right problem-solving technique based on how you're stuck",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        " problem",
        "based",
        "dispatch",
        "how",
        "problem",
        "right",
        "solving",
        "solving dispatch",
        "stuck",
        "technique"
      ]
    },
    {
      "name": "When Stuck - Problem-Solving Dispatch",
      "description": "Dispatch to the right problem-solving technique based on how you're stuck",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        " problem",
        "based",
        "dispatch",
        "how",
        "problem",
        "right",
        "solving",
        "solving dispatch",
        "stuck",
        "technique"
      ]
    },
    {
      "name": "code-review",
      "description": "Use when receiving code review feedback (especially if unclear or technically questionable), when completing tasks or major features requiring review before proceeding, or before making any completion/success claims. Covers three practices - receiving feedback with technical rigor over performative agreement, requesting reviews via code-reviewer subagent, and verification gates requiring evidence...",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "agreement",
        "any",
        "before",
        "claims",
        "code",
        "completing",
        "completion",
        "covers",
        "development",
        "driven"
      ]
    },
    {
      "name": "code-reviewer",
      "description": "Use when reviewing pull requests, conducting code quality audits, or identifying security vulnerabilities. Invoke for PR reviews, code quality checks, refactoring suggestions.",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "audits",
        "checks",
        "code",
        "conducting",
        "identifying",
        "invoke",
        "pull",
        "quality",
        "refactoring",
        "requests"
      ]
    },
    {
      "name": "debugging",
      "description": "Systematic debugging frameworks for finding and fixing bugs - includes root cause analysis, defense-in-depth validation, and verification protocols",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "analysis",
        "bugs",
        "cause",
        "debugging",
        "defense",
        "depth",
        "finding",
        "fixing",
        "frameworks",
        "includes"
      ]
    },
    {
      "name": "debugging-wizard",
      "description": "Use when investigating errors, analyzing stack traces, or finding root causes of unexpected behavior. Invoke for error investigation, troubleshooting, log analysis, root cause analysis.",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "analysis",
        "analyzing",
        "behavior",
        "cause",
        "causes",
        "debugging",
        "error",
        "errors",
        "finding",
        "investigating"
      ]
    },
    {
      "name": "dev-session",
      "description": "Manage long development sessions with structured progress tracking. Creates SESSION.md files for multi-session handoff, checkpoints progress with WIP commits, and captures learnings to CLAUDE.md. Trigger with 'start session', 'checkpoint', 'wrap session', 'resume session', or 'context getting full'.",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "captures",
        "checkpoint",
        "checkpoints",
        "claude",
        "commits",
        "context",
        "creates",
        "dev",
        "development",
        "files"
      ]
    },
    {
      "name": "problem-solving",
      "description": "Creative problem-solving techniques for breaking through stuck points - includes collision-zone thinking, inversion, pattern recognition, and simplification",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "breaking",
        "collision",
        "creative",
        "includes",
        "inversion",
        "pattern",
        "points",
        "problem",
        "recognition",
        "simplification"
      ]
    },
    {
      "name": "sample-skill",
      "description": "No description available",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "available",
        "description",
        "sample",
        "skill"
      ]
    },
    {
      "name": "sample-skill",
      "description": "No description available",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "available",
        "description",
        "sample",
        "skill"
      ]
    },
    {
      "name": "sequential-thinking",
      "description": "Use when complex problems require systematic step-by-step reasoning with ability to revise thoughts, branch into alternative approaches, or dynamically adjust scope. Ideal for multi-stage analysis, design planning, problem decomposition, or tasks with initially unclear scope.",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "ability",
        "adjust",
        "alternative",
        "analysis",
        "approaches",
        "branch",
        "complex",
        "decomposition",
        "design",
        "dynamically"
      ]
    },
    {
      "name": "skill-code-simplifier",
      "description": "Automatically refine and simplify skill content while preserving functionality. Based on Anthropic's code-simplifier pattern. Enhances clarity, enforces standards, reduces verbosity, eliminates redundancy, and maintains balance between brevity and understanding. Operates autonomously on recent changes. Use after editing skills or before packaging.",
      "tags": [
        "meta-skill",
        "refactoring",
        "clarity",
        "automation",
        "quality"
      ],
      "category": "Meta-skill",
      "keywords": [
        "after",
        "anthropic",
        "automatically",
        "automation",
        "autonomously",
        "balance",
        "based",
        "before",
        "between",
        "brevity"
      ]
    },
    {
      "name": "skill-consistency-enforcer",
      "description": "Automatically enforce style guide and formatting standards across all skills. Checks frontmatter completeness, standardizes terminology, fixes formatting inconsistencies, validates tag conventions, and ensures section ordering. Runs on save or commit. Use when maintaining library consistency or onboarding new contributors.",
      "tags": [
        "meta-skill",
        "consistency",
        "formatting",
        "automation",
        "standards"
      ],
      "category": "Meta-skill",
      "keywords": [
        "across",
        "all",
        "automatically",
        "automation",
        "checks",
        "commit",
        "completeness",
        "consistency",
        "contributors",
        "conventions"
      ]
    },
    {
      "name": "skill-creator",
      "description": "Guide for creating effective skills. This skill should be used when users want to create a new skill (or update an existing skill) that extends Claude's capabilities with specialized knowledge, workflows, or tool integrations.",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "capabilities",
        "claude",
        "create",
        "creating",
        "creator",
        "effective",
        "existing",
        "extends",
        "guide",
        "integrations"
      ]
    },
    {
      "name": "skill-creator",
      "description": "Create or update Claude skills. Use for new skills, skill references, skill scripts, optimizing existing skills, extending Claude's capabilities.",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "capabilities",
        "claude",
        "create",
        "creator",
        "existing",
        "extending",
        "new",
        "optimizing",
        "references",
        "scripts"
      ]
    },
    {
      "name": "skill-dependency-mapper",
      "description": "Visualize and manage skill dependencies and relationships. Builds dependency graphs, detects circular dependencies, suggests skill composition, identifies orphaned skills, recommends splitting, generates Mermaid diagrams, and tracks skill families. Use when organizing library, planning new skills, refactoring existing skills, or understanding skill relationships.",
      "tags": [
        "meta-skill",
        "dependencies",
        "visualization",
        "architecture",
        "organization"
      ],
      "category": "Meta-skill",
      "keywords": [
        "architecture",
        "builds",
        "circular",
        "composition",
        "dependencies",
        "dependency",
        "detects",
        "diagrams",
        "existing",
        "families"
      ]
    },
    {
      "name": "skill-documentation-generator",
      "description": "Auto-generate comprehensive documentation from skills in multiple formats (PDF, HTML, EPUB, Markdown). Converts skills to static sites (Docusaurus/GitBook), generates API docs from scripts, creates video tutorials, builds searchable indexes, and exports for non-AI use. Use when publishing skills or creating external documentation.",
      "tags": [
        "meta-skill",
        "documentation",
        "export",
        "publishing",
        "automation"
      ],
      "category": "Meta-skill",
      "keywords": [
        "api",
        "auto",
        "automation",
        "builds",
        "comprehensive",
        "converts",
        "creates",
        "creating",
        "docs",
        "documentation"
      ]
    },
    {
      "name": "skill-example-validator",
      "description": "Validate all commands and examples in skills are executable and produce expected outputs. Tests commands in sandbox, checks HTTP URLs, verifies file paths, validates environment variables, and generates test reports. Use before releases, in CI/CD, or when updating examples.",
      "tags": [
        "meta-skill",
        "validation",
        "testing",
        "quality",
        "automation"
      ],
      "category": "Meta-skill",
      "keywords": [
        "all",
        "automation",
        "before",
        "checks",
        "commands",
        "environment",
        "example",
        "examples",
        "executable",
        "expected"
      ]
    },
    {
      "name": "skill-quality-auditor",
      "description": "Automatically audit skills for quality, completeness, and best practices. Scans SKILL.md for required sections, validates command executability, checks metadata completeness, analyzes readability metrics, detects broken links, and generates quality scores (0-100) with actionable improvement suggestions. Use when creating new skills, before packaging, during skill reviews, or auditing entire library.",
      "tags": [
        "meta-skill",
        "quality",
        "validation",
        "best-practices",
        "automation"
      ],
      "category": "Meta-skill",
      "keywords": [
        "actionable",
        "analyzes",
        "audit",
        "auditing",
        "auditor",
        "automatically",
        "automation",
        "before",
        "best",
        "best-practices"
      ]
    },
    {
      "name": "skill-test-generator",
      "description": "Automatically generate test cases and validation scripts for skills. Extracts commands from SKILL.md, creates test scripts (bash/pytest), generates test fixtures, validates expected outputs, tests failure modes, and supports CI/CD integration. Use when creating skills, before releases, or establishing regression test suites.",
      "tags": [
        "meta-skill",
        "testing",
        "validation",
        "automation",
        "quality"
      ],
      "category": "Meta-skill",
      "keywords": [
        "automatically",
        "automation",
        "bash",
        "before",
        "cases",
        "commands",
        "creates",
        "creating",
        "establishing",
        "expected"
      ]
    },
    {
      "name": "skill-tester",
      "description": "No description available",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "available",
        "description",
        "skill",
        "tester"
      ]
    },
    {
      "name": "skills-store-access",
      "description": "MAIN ENTRY POINT - Equip any AI system (Claude Code, Claude.ai, Claude API, Cursor, or any platform) with complete Skills store capabilities. This foundational skill enables intelligent skill discovery, proactive installation, and lifecycle management without filling context. Works with any system supporting Claude skills - platform-aware installation auto-detects environment and...",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "access",
        "across",
        "analysis",
        "any",
        "api",
        "appropriate",
        "auto",
        "aware",
        "capabilities",
        "category"
      ]
    },
    {
      "name": "spec-miner",
      "description": "Use when understanding legacy or undocumented systems, creating documentation for existing code, or extracting specifications from implementations. Invoke for legacy analysis, code archaeology, undocumented features.",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "analysis",
        "archaeology",
        "code",
        "creating",
        "documentation",
        "existing",
        "extracting",
        "features",
        "from",
        "implementations"
      ]
    },
    {
      "name": "superpowers",
      "description": "Foundational skill that teaches agents how to use skills to their best capabilities. Enables structured development workflows using test-driven development, systematic debugging, collaborative planning, subagent-driven development, and proper code review. Helps agents work systematically rather than ad-hoc, emphasizing TDD, YAGNI, DRY principles, and evidence-based verification. Use when agents need to...",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "agents",
        "based",
        "batches",
        "best",
        "capabilities",
        "claude",
        "code",
        "collaborate",
        "collaborative",
        "debug"
      ]
    },
    {
      "name": "superpowers-lab",
      "description": "Experimental skills for Claude Code Superpowers - new techniques still being refined and tested. Skills here may change over time. Use when exploring experimental development workflows, testing new skill techniques, or trying cutting-edge approaches to agent-assisted development. Based on obra/superpowers-lab.",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "agent",
        "approaches",
        "assisted",
        "based",
        "change",
        "claude",
        "code",
        "cutting",
        "development",
        "edge"
      ]
    },
    {
      "name": "tdd-guide",
      "description": "Test-driven development workflow with test generation, coverage analysis, and multi-framework support",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "analysis",
        "coverage",
        "development",
        "driven",
        "framework",
        "generation",
        "guide",
        "multi",
        "support",
        "tdd"
      ]
    },
    {
      "name": "template-skill",
      "description": "Replace with description of the skill and when Claude should use it.",
      "tags": [],
      "category": "Meta-skill",
      "keywords": [
        "claude",
        "description",
        "replace",
        "skill",
        "template",
        "use",
        "when"
      ]
    },
    {
      "name": "campaign-analytics",
      "description": "Analyzes campaign performance with multi-touch attribution, funnel conversion, and ROI calculation for marketing optimization",
      "tags": [],
      "category": "Scientific",
      "keywords": [
        "analytics",
        "analyzes",
        "attribution",
        "calculation",
        "campaign",
        "conversion",
        "funnel",
        "marketing",
        "multi",
        "optimization"
      ]
    },
    {
      "name": "claude-scientific-skills",
      "description": "Comprehensive collection of ready-to-use scientific skills, including working with specialized scientific libraries and databases. Use when performing scientific computing, data analysis, working with scientific databases, running simulations, or processing scientific data. Based on K-Dense-AI/claude-scientific-skills.",
      "tags": [],
      "category": "Scientific",
      "keywords": [
        "analysis",
        "based",
        "claude",
        "collection",
        "comprehensive",
        "computing",
        "data",
        "databases",
        "dense",
        "including"
      ]
    },
    {
      "name": "financial-analyst",
      "description": "Performs financial ratio analysis, DCF valuation, budget variance analysis, and rolling forecast construction for strategic decision-making",
      "tags": [],
      "category": "Scientific",
      "keywords": [
        "analysis",
        "analyst",
        "budget",
        "construction",
        "dcf",
        "decision",
        "financial",
        "forecast",
        "making",
        "performs"
      ]
    },
    {
      "name": "pandas-pro",
      "description": "Use when working with pandas DataFrames, data cleaning, aggregation, merging, or time series analysis. Invoke for data manipulation, missing value handling, groupby operations, or performance optimization.",
      "tags": [],
      "category": "Scientific",
      "keywords": [
        "aggregation",
        "analysis",
        "cleaning",
        "data",
        "dataframes",
        "groupby",
        "handling",
        "invoke",
        "manipulation",
        "merging"
      ]
    },
    {
      "name": "senior-computer-vision",
      "description": "Computer vision engineering skill for object detection, image segmentation, and visual AI systems. Covers CNN and Vision Transformer architectures, YOLO/Faster R-CNN/DETR detection, Mask R-CNN/SAM segmentation, and production deployment with ONNX/TensorRT. Includes PyTorch, torchvision, Ultralytics, Detectron2, and MMDetection frameworks. Use when building detection pipelines, training custom models, optimizing inference, or deploying...",
      "tags": [],
      "category": "Scientific",
      "keywords": [
        "architectures",
        "building",
        "cnn",
        "computer",
        "covers",
        "custom",
        "deploying",
        "deployment",
        "detection",
        "detr"
      ]
    },
    {
      "name": "senior-data-engineer",
      "description": "Data engineering skill for building scalable data pipelines, ETL/ELT systems, and data infrastructure. Expertise in Python, SQL, Spark, Airflow, dbt, Kafka, and modern data stack. Includes data modeling, pipeline orchestration, data quality, and DataOps. Use when designing data architectures, building data pipelines, optimizing data workflows, implementing data governance, or troubleshooting...",
      "tags": [],
      "category": "Scientific",
      "keywords": [
        "airflow",
        "architectures",
        "building",
        "data",
        "dataops",
        "dbt",
        "designing",
        "elt",
        "engineer",
        "engineering"
      ]
    },
    {
      "name": "senior-data-scientist",
      "description": "World-class data science skill for statistical modeling, experimentation, causal inference, and advanced analytics. Expertise in Python (NumPy, Pandas, Scikit-learn), R, SQL, statistical methods, A/B testing, time series, and business intelligence. Includes experiment design, feature engineering, model evaluation, and stakeholder communication. Use when designing experiments, building predictive models, performing causal analysis,...",
      "tags": [],
      "category": "Scientific",
      "keywords": [
        "advanced",
        "analysis",
        "analytics",
        "building",
        "business",
        "causal",
        "class",
        "communication",
        "data",
        "decisions"
      ]
    },
    {
      "name": "spark-engineer",
      "description": "Use when building Apache Spark applications, distributed data processing pipelines, or optimizing big data workloads. Invoke for DataFrame API, Spark SQL, RDD operations, performance tuning, streaming analytics.",
      "tags": [],
      "category": "Scientific",
      "keywords": [
        "analytics",
        "apache",
        "api",
        "applications",
        "big",
        "building",
        "data",
        "dataframe",
        "distributed",
        "engineer"
      ]
    },
    {
      "name": "ffuf-web-fuzzing",
      "description": "Expert guidance for ffuf web fuzzing during penetration testing, including authenticated fuzzing with raw requests, auto-calibration, and result analysis. Use when performing web application security testing, fuzzing endpoints, testing authentication mechanisms, or conducting penetration tests. Based on jthack/ffuf_claude_skill.",
      "tags": [],
      "category": "Security",
      "keywords": [
        "analysis",
        "application",
        "authenticated",
        "authentication",
        "auto",
        "based",
        "calibration",
        "conducting",
        "during",
        "endpoints"
      ]
    },
    {
      "name": "gdpr-dsgvo-expert",
      "description": "GDPR and German DSGVO compliance automation. Scans codebases for privacy risks, generates DPIA documentation, tracks data subject rights requests. Use for GDPR compliance assessments, privacy audits, data protection planning, DPIA generation, and data subject rights management.",
      "tags": [],
      "category": "Security",
      "keywords": [
        "assessments",
        "audits",
        "automation",
        "codebases",
        "compliance",
        "data",
        "documentation",
        "dpia",
        "dsgvo",
        "expert"
      ]
    },
    {
      "name": "information-security-manager-iso27001",
      "description": "ISO 27001 ISMS implementation and cybersecurity governance for HealthTech and MedTech companies. Use for ISMS design, security risk assessment, control implementation, ISO 27001 certification, security audits, incident response, and compliance verification. Covers ISO 27001, ISO 27002, healthcare security, and medical device cybersecurity.",
      "tags": [],
      "category": "Security",
      "keywords": [
        "assessment",
        "audits",
        "certification",
        "companies",
        "compliance",
        "control",
        "covers",
        "cybersecurity",
        "design",
        "device"
      ]
    },
    {
      "name": "isms-audit-expert",
      "description": "Information Security Management System auditing for ISO 27001 compliance, security control assessment, and certification support",
      "tags": [],
      "category": "Security",
      "keywords": [
        "assessment",
        "audit",
        "auditing",
        "certification",
        "compliance",
        "control",
        "expert",
        "information",
        "isms",
        "iso"
      ]
    },
    {
      "name": "ms365-tenant-manager",
      "description": "Microsoft 365 tenant administration for Global Administrators. Automate M365 tenant setup, Office 365 admin tasks, Azure AD user management, Exchange Online configuration, Teams administration, and security policies. Generate PowerShell scripts for bulk operations, Conditional Access policies, license management, and compliance reporting. Use for M365 tenant manager, Office 365 admin, Azure...",
      "tags": [],
      "category": "Security",
      "keywords": [
        "access",
        "admin",
        "administration",
        "administrator",
        "administrators",
        "automate",
        "automation",
        "azure",
        "bulk",
        "compliance"
      ]
    },
    {
      "name": "risk-management-specialist",
      "description": "Medical device risk management specialist implementing ISO 14971 throughout product lifecycle. Provides risk analysis, risk evaluation, risk control, and post-production information analysis.",
      "tags": [],
      "category": "Security",
      "keywords": [
        "analysis",
        "control",
        "device",
        "evaluation",
        "implementing",
        "information",
        "iso",
        "lifecycle",
        "management",
        "medical"
      ]
    },
    {
      "name": "secure-code-guardian",
      "description": "Use when implementing authentication/authorization, securing user input, or preventing OWASP Top 10 vulnerabilities. Invoke for authentication, authorization, input validation, encryption, OWASP Top 10 prevention.",
      "tags": [],
      "category": "Security",
      "keywords": [
        "authentication",
        "authorization",
        "code",
        "encryption",
        "guardian",
        "implementing",
        "input",
        "invoke",
        "owasp",
        "preventing"
      ]
    },
    {
      "name": "security-reviewer",
      "description": "Use when conducting security audits, reviewing code for vulnerabilities, or analyzing infrastructure security. Invoke for SAST scans, penetration testing, DevSecOps practices, cloud security reviews.",
      "tags": [],
      "category": "Security",
      "keywords": [
        "analyzing",
        "audits",
        "cloud",
        "code",
        "conducting",
        "devsecops",
        "infrastructure",
        "invoke",
        "penetration",
        "practices"
      ]
    },
    {
      "name": "senior-secops",
      "description": "Comprehensive SecOps skill for application security, vulnerability management, compliance, and secure development practices. Includes security scanning, vulnerability assessment, compliance checking, and security automation. Use when implementing security controls, conducting security audits, responding to vulnerabilities, or ensuring compliance requirements.",
      "tags": [],
      "category": "Security",
      "keywords": [
        "application",
        "assessment",
        "audits",
        "automation",
        "checking",
        "compliance",
        "comprehensive",
        "conducting",
        "controls",
        "development"
      ]
    },
    {
      "name": "senior-security",
      "description": "Security engineering toolkit for threat modeling, vulnerability analysis, secure architecture, and penetration testing. Includes STRIDE analysis, OWASP guidance, cryptography patterns, and security scanning tools.",
      "tags": [],
      "category": "Security",
      "keywords": [
        "analysis",
        "architecture",
        "cryptography",
        "engineering",
        "guidance",
        "includes",
        "modeling",
        "owasp",
        "patterns",
        "penetration"
      ]
    },
    {
      "name": "skill-library-manager",
      "description": "Manage Claude skills lifecycle in the Skills_librairie repository at /Users/guillaumebld/Documents/Skills/Skills_librairie. Skills are organized in Skills/ directory by category (Meta-skill/, Automation/, Infrastructure-DevOps/, Development/, Design-Creative/, Communication/, Document-Generation/, AI-Agents/). Create new skills following best practices, search existing skills, manage versions with semantic versioning, sync with GitHub (GuillaumeBld/Skills_librairie), and install skills to Claude.ai or...",
      "tags": [],
      "category": "skill-library-manager",
      "keywords": [
        "agents",
        "authentication",
        "automation",
        "best",
        "category",
        "claude",
        "cli",
        "collection",
        "communication",
        "create"
      ]
    }
  ]
}